{
  "intents": [
    {
      "name": "Physical Presence for Company Setup",
      "category": "company_management",
      "question": "Do I need to be physically present to open a company?",
      "responses": [
        "No, physical presence is not required to set up a company at Meydan Free Zone. You can complete the entire incorporation process remotely — from submitting documents to getting your license. Many of our clients set up their companies from abroad without ever stepping foot in Dubai.",
        "Good news — you don't need to be in Dubai to open your company. The whole process at Meydan Free Zone can be done remotely. Document submission, KYC, approvals — all handled online through our portal. You only need to be in the UAE later if you're applying for a residence visa and need to complete medical and Emirates ID procedures.",
        "Physical presence isn't required for company incorporation at Meydan Free Zone. Everything from license application to document signing can be done remotely. The only time you'd need to be in the UAE is for residence visa processing — specifically for the medical test and Emirates ID biometrics."
      ],
      "keywords": [
        "physical presence",
        "need to be present",
        "open company remotely",
        "remote setup",
        "be in dubai",
        "incorporate remotely",
        "physically present",
        "setup from abroad",
        "online company setup"
      ],
      "source": "FAQ_sheet.pdf",
      "sourceTitle": "Meydan FZ FAQ Sheet"
    },
    {
      "name": "Share Capital Requirements",
      "category": "company_management",
      "question": "Are there any paid-up share capital requirements?",
      "responses": [
        "No paid-up share capital is required at Meydan Free Zone. There's also no minimum or maximum share capital requirement — you decide what makes sense for your business. The only rule is that share allocation and total share capital must be whole numbers, not fractions. So 45% or 46% is fine, but 45.5% wouldn't work.",
        "There are zero paid-up share capital requirements. You're free to set your share capital at whatever amount suits your business. Just keep in mind the shares must be whole numbers — no fractions allowed. For example, a 50/50 split works, but 33.33% wouldn't.",
        "Meydan Free Zone doesn't require any paid-up share capital. There's no minimum and no maximum either. Set it at whatever level makes sense for your business needs. One thing to note: share allocation must be whole numbers, not fractions."
      ],
      "keywords": [
        "share capital",
        "paid-up capital",
        "capital requirements",
        "minimum capital",
        "maximum capital",
        "share capital fraction",
        "capital needed",
        "initial capital",
        "required capital"
      ],
      "source": "FAQ_sheet.pdf",
      "sourceTitle": "Meydan FZ FAQ Sheet"
    },
    {
      "name": "NOC for Shareholders",
      "category": "company_management",
      "question": "Do shareholders need NOC to incorporate a company?",
      "responses": [
        "No, neither individual nor corporate shareholders need a No Objection Certificate (NOC) to incorporate a company at Meydan Free Zone. You can go ahead and set up your company without any NOC requirements from current employers or other entities.",
        "NOC is not required. Whether you're an individual or a corporate shareholder, you can incorporate a company at Meydan Free Zone without any No Objection Certificate. This makes the process much simpler compared to some other jurisdictions.",
        "You don't need a NOC to incorporate at Meydan Free Zone — this applies to both individual and corporate shareholders. No approval needed from your current employer or any other entity to get started."
      ],
      "keywords": [
        "noc shareholder",
        "no objection certificate",
        "noc required",
        "noc incorporate",
        "noc company setup",
        "shareholder noc",
        "need noc",
        "employer noc"
      ],
      "source": "FAQ_sheet.pdf",
      "sourceTitle": "Meydan FZ FAQ Sheet"
    },
    {
      "name": "Zero Visa License",
      "category": "company_management",
      "question": "Can I apply for a zero visa license?",
      "responses": [
        "Yes, absolutely! You can get a license with zero visa allocation at Meydan Free Zone. This is popular with businesses that don't need employee visas — maybe you're running things remotely or already have residency through another company. You still get the full license benefits without the visa overhead.",
        "Yes, zero-visa licenses are available at Meydan Free Zone. It's a great option if you don't need to sponsor any employees or yourself on a visa. You get the full company setup — license, documents, everything — just without the visa allocation.",
        "You can definitely get a zero-visa license. Many clients choose this option when they already have residency elsewhere or plan to run the business remotely. You'll receive the complete license package without any visa quota attached."
      ],
      "keywords": [
        "zero visa",
        "0 visa",
        "no visa license",
        "license without visa",
        "zero visa license",
        "no visa allocation",
        "license only",
        "visa free license"
      ],
      "source": "FAQ_sheet.pdf",
      "sourceTitle": "Meydan FZ FAQ Sheet"
    },
    {
      "name": "Combining Business Activities",
      "category": "company_management",
      "question": "Can I combine commercial, professional, and trading activities?",
      "responses": [
        "Yes, you can combine commercial, professional, and trading activities on the same license at Meydan Free Zone. You get 3 groups of activities free of cost during incorporation. If you need more, additional activities cost AED 1,000 each. Approvals are only required for regulated activities.",
        "Absolutely — Meydan Free Zone allows you to mix commercial, professional, and trading activities on one license. The first 3 activity groups are included free. Need more? Each additional activity is AED 1,000. Only regulated activities need special approval.",
        "Yes, the combination of activities is permitted. You can include commercial, professional, and trading activities all on the same license. Three activity groups come free with incorporation; extras are AED 1,000 per activity. The only restriction is regulated activities which need separate approval."
      ],
      "keywords": [
        "combine activities",
        "mix activities",
        "commercial professional trading",
        "multiple activities",
        "activity combination",
        "same license activities",
        "3 activities free",
        "additional activities",
        "activity groups"
      ],
      "source": "FAQ_sheet.pdf",
      "sourceTitle": "Meydan FZ FAQ Sheet"
    },
    {
      "name": "Documents After Incorporation",
      "category": "company_management",
      "question": "What documents do I receive after company incorporation?",
      "responses": [
        "After incorporation at Meydan Free Zone, you receive five key documents: 1) Business License, 2) Certificate of Formation, 3) Share Register, 4) Memorandum of Association (MOA), and 5) Lease Agreement. These are your essential company documents for opening bank accounts, entering contracts, and proving your business is legally established.",
        "Upon incorporation, you'll receive: Business License, Certificate of Formation, Share Register, Memorandum of Association, and Lease Agreement. That's your complete company documentation package — everything you need to start operating, open bank accounts, and deal with government entities.",
        "You get five documents after incorporation: your Business License, Certificate of Formation, Share Register, Memorandum of Association (MOA), and Lease Agreement. Note that you can't provide your own MOA, but you can request additions, removals, or edits to clauses in the Meydan MOA — subject to legal approval."
      ],
      "keywords": [
        "documents after incorporation",
        "company documents",
        "what documents",
        "incorporation documents",
        "business license document",
        "certificate of formation",
        "share register",
        "memorandum of association",
        "moa",
        "lease agreement"
      ],
      "source": "FAQ_sheet.pdf",
      "sourceTitle": "Meydan FZ FAQ Sheet"
    },
    {
      "name": "Shareholders Limit and Fees",
      "category": "company_management",
      "question": "How many shareholders are allowed on a license?",
      "responses": [
        "A maximum of 100 shareholders are permitted on the license. The first 6 shareholders are included in standard licensing fees. Beyond that, each additional shareholder costs AED 2,000. So for example, if you have 10 shareholders, you'd pay an extra AED 8,000 (4 additional × AED 2,000). There's no minimum or maximum age requirement for shareholders.",
        "You can have up to 100 shareholders on your license. The first 6 are covered in your standard fees. Each additional shareholder from the 7th onward costs AED 2,000. Quick math: 10 shareholders = AED 8,000 extra (4 × AED 2,000). And there's no age restriction — no minimum, no maximum.",
        "The maximum is 100 shareholders per license. Standard licensing fees cover up to 6 shareholders. Beyond that, it's AED 2,000 per additional shareholder. No age restrictions apply — shareholders can be any age. Also, you can be a partner/shareholder in multiple companies simultaneously."
      ],
      "keywords": [
        "shareholders limit",
        "how many shareholders",
        "maximum shareholders",
        "100 shareholders",
        "additional shareholder cost",
        "2000 shareholder",
        "shareholder fees",
        "number of shareholders",
        "shareholder age"
      ],
      "source": "FAQ_sheet.pdf",
      "sourceTitle": "Meydan FZ FAQ Sheet"
    },
    {
      "name": "Directors and Managers Limit",
      "category": "company_management",
      "question": "How many directors and managers are allowed?",
      "responses": [
        "You can have a maximum of 4 directors and 1 manager on the license. Directors oversee the company's strategic direction while the manager handles day-to-day operations. These limits are per company, not per shareholder.",
        "The limits are: up to 4 directors and 1 manager per license. Directors are responsible for governance and strategic decisions, while the single manager handles operational management. Both are registered on your company documents.",
        "Maximum 4 directors and 1 manager are permitted on each license. That's a straightforward setup — four directors for governance and one manager for operations."
      ],
      "keywords": [
        "directors limit",
        "managers limit",
        "how many directors",
        "how many managers",
        "maximum directors",
        "4 directors",
        "1 manager",
        "number of directors"
      ],
      "source": "FAQ_sheet.pdf",
      "sourceTitle": "Meydan FZ FAQ Sheet"
    },
    {
      "name": "Free Activities and Additional Cost",
      "category": "company_management",
      "question": "How many activities are free and what do extras cost?",
      "responses": [
        "You can incorporate your company with 3 groups of activities at no additional charge. If you need more activities beyond those 3 groups, each additional activity costs AED 1,000. Approvals are only required for regulated activities — standard activities can be added without any special permission.",
        "Three activity groups come free with your license. Want more? Each additional activity is AED 1,000. No approvals needed for standard activities — only regulated ones require special permission. This gives you plenty of flexibility to diversify your business offerings.",
        "You get 3 activity groups free during incorporation. Extra activities are AED 1,000 each. Only regulated activities need approval; everything else is straightforward. Most clients find 3 groups more than enough to cover their business needs."
      ],
      "keywords": [
        "free activities",
        "activity cost",
        "1000 activity",
        "additional activity",
        "how many activities free",
        "activity groups",
        "add activity",
        "extra activities",
        "regulated activities"
      ],
      "source": "FAQ_sheet.pdf",
      "sourceTitle": "Meydan FZ FAQ Sheet"
    },
    {
      "name": "Multi-Year License Discount",
      "category": "company_management",
      "question": "Is there a discount for multi-year license applications?",
      "responses": [
        "Yes! There's a standard 15% discount on multi-year license applications of 2 or more years — this applies to both the license and visa allocations. Plus, multi-year license holders get a free amendment. For example, a 2-year license comes with 1 free amendment. The maximum license validity is 10 years.",
        "Multi-year licenses get a 15% discount — available for 2-year terms and above, covering both the license and visa allocations. Bonus: you also get a free amendment with multi-year licenses. So a 2-year license includes 1 free amendment. You can go up to 10 years maximum validity.",
        "Absolutely — book 2 or more years and you get 15% off the license and visa allocation fees. Multi-year licenses also come with a free amendment included. License validity can be set up to a maximum of 10 years, which maximizes your savings with that 15% discount."
      ],
      "keywords": [
        "multi year discount",
        "multi-year license",
        "15 percent discount",
        "discount license",
        "2 year license",
        "long term license",
        "multi year savings",
        "license discount",
        "bulk year discount"
      ],
      "source": "FAQ_sheet.pdf",
      "sourceTitle": "Meydan FZ FAQ Sheet"
    },
    {
      "name": "Multiple Company Ownership",
      "category": "company_management",
      "question": "Can I be a partner in more than one company?",
      "responses": [
        "Yes, you can be a partner or shareholder in multiple companies at Meydan Free Zone. There's no restriction on how many companies you can be involved in. Many entrepreneurs hold stakes in several businesses simultaneously.",
        "Absolutely — there's no limit on how many companies you can be a partner or shareholder in. You're free to diversify your business interests across multiple companies at Meydan Free Zone.",
        "Yes, you can hold shares in multiple companies. Meydan Free Zone doesn't restrict the number of companies you can be a partner or shareholder in. Great for serial entrepreneurs or investors managing a portfolio of businesses."
      ],
      "keywords": [
        "multiple companies",
        "partner more than one",
        "shareholder multiple",
        "more than one company",
        "several companies",
        "hold shares multiple",
        "be partner in two",
        "own multiple companies"
      ],
      "source": "FAQ_sheet.pdf",
      "sourceTitle": "Meydan FZ FAQ Sheet"
    },
    {
      "name": "Post Application Steps",
      "category": "company_management",
      "question": "What happens after submitting the license application?",
      "responses": [
        "After you submit your license application on the Meydan portal, all shareholders, the manager, and directors receive an email to complete three tasks: 1) KYC (Know Your Customer) verification, 2) Accept or Reject the application, and 3) Complete the compliance form if applicable. Only once everyone completes their tasks will our team receive the application to review and proceed.",
        "Once the application is submitted, it's over to your team. Shareholders, manager, and directors each get an email with three tasks: KYC verification, Accept/Reject the application, and fill out the compliance form if needed. Our team can only start processing once all parties have completed their tasks. So make sure everyone responds promptly!",
        "The next step after submission is email verification for all stakeholders. Shareholders, manager, and directors receive emails to: complete KYC, accept or reject the application, and submit the compliance form (if applicable). The application only moves to our review team once all tasks are completed by all parties."
      ],
      "keywords": [
        "after submission",
        "next step application",
        "after license application",
        "kyc verification",
        "portal application",
        "application process",
        "what happens after",
        "license approval process",
        "accept reject application"
      ],
      "source": "FAQ_sheet.pdf",
      "sourceTitle": "Meydan FZ FAQ Sheet"
    },
    {
      "name": "License Validity Period",
      "category": "company_management",
      "question": "What is the maximum license validity?",
      "responses": [
        "The maximum license validity at Meydan Free Zone is 10 years. You choose the validity period during incorporation — it can be 1 year, 2 years, or up to 10 years. Longer terms get a 15% discount on license and visa allocation fees for 2+ years.",
        "You can set your license validity for up to 10 years. The period is chosen during incorporation. Going for 2 years or more? You'll get a 15% discount on both the license and visa allocation costs.",
        "Maximum license validity is 10 years — you pick the duration during setup. One year is standard, but multi-year options (2-10 years) come with a 15% discount. It's entirely up to you based on your business planning horizon."
      ],
      "keywords": [
        "license validity",
        "maximum validity",
        "10 year license",
        "license duration",
        "license period",
        "how long license valid",
        "license years",
        "license expiry period"
      ],
      "source": "FAQ_sheet.pdf",
      "sourceTitle": "Meydan FZ FAQ Sheet"
    },
    {
      "name": "License Grace Period and Penalties",
      "category": "company_management",
      "question": "What is the grace period after license expires and what are the penalties?",
      "responses": [
        "You get a 30-day grace period from the license expiry date to renew. If you don't renew within that grace period, there's a one-time penalty of AED 500. Important distinction: if you're cancelling the license after it's expired and the grace period has passed, you don't pay the license penalty — but you will still need to pay any immigration card fines if you have one.",
        "The grace period is 30 days after license expiry. Miss that window and you're looking at an AED 500 penalty (one-time fee). Note: this is separate from immigration card penalties. If you're cancelling your license post-expiry, the license penalty is waived, but immigration card fines still apply.",
        "30 days grace period after your license expires. If you haven't renewed by then, it's AED 500 as a one-time penalty. Here's a useful tip: if you're planning to cancel your license after expiry, the license penalty doesn't apply — however, any outstanding immigration card fines (AED 250/month) will still need to be settled."
      ],
      "keywords": [
        "grace period license",
        "license penalty",
        "500 penalty",
        "license expired",
        "renew after expiry",
        "late renewal",
        "30 day grace",
        "license fine",
        "renewal deadline"
      ],
      "source": "FAQ_sheet.pdf",
      "sourceTitle": "Meydan FZ FAQ Sheet"
    },
    {
      "name": "Immigration Card Grace Period and Penalties",
      "category": "company_management",
      "question": "Is there a grace period for the immigration card?",
      "responses": [
        "No, there is no grace period for the immigration card — unlike the license which gives you 30 days. If your immigration card expires, the penalty kicks in immediately at AED 250 per month from the expiry date. The immigration card has the same validity as your business license, so they typically need to be renewed together.",
        "Unfortunately, no grace period for the immigration card. The penalty of AED 250 per month starts right from the expiry date. This is different from the license which gives a 30-day grace. Both the immigration card and visa allocation share the same validity as your business license, so renew them all together.",
        "There's no grace period for the immigration card. Once it expires, you're charged AED 250 per month as a penalty. Make sure to renew it alongside your business license since they share the same validity period. Visa allocations also need annual renewal along with your license and immigration card."
      ],
      "keywords": [
        "immigration card grace",
        "immigration card penalty",
        "250 month penalty",
        "immigration card expired",
        "no grace immigration",
        "immigration card fine",
        "immigration card renewal",
        "immigration card validity"
      ],
      "source": "FAQ_sheet.pdf",
      "sourceTitle": "Meydan FZ FAQ Sheet"
    },
    {
      "name": "Share Allocation Rules",
      "category": "company_management",
      "question": "Can share allocation be a fraction?",
      "responses": [
        "No, share allocation and total share capital cannot be fractions — they must be whole numbers. For example, 45.50% is not allowed; it must be either 45% or 46%. This applies to all share distributions among shareholders. Also, there's no minimum or maximum share capital requirement.",
        "Share allocation must be in whole numbers only, no fractions allowed. So 50/50 works, 70/30 works, but 33.33% doesn't. Same rule for total share capital — whole numbers only. On the plus side, there's no minimum or maximum share capital limit.",
        "Fractions are not permitted in share allocation or total share capital. Everything must be whole numbers — so 45.5% is a no-go, you'd need to round to 45% or 46%. Keep this in mind when distributing shares among multiple shareholders."
      ],
      "keywords": [
        "share fraction",
        "share allocation fraction",
        "whole number shares",
        "share percentage",
        "capital fraction",
        "share distribution",
        "split shares",
        "share allocation rules"
      ],
      "source": "FAQ_sheet.pdf",
      "sourceTitle": "Meydan FZ FAQ Sheet"
    },
    {
      "name": "Company License Address",
      "category": "company_management",
      "question": "What address appears on the company license?",
      "responses": [
        "The address on your license will be: Meydan Grandstand, Next to Meydan Hotel, 6th Floor, Meydan Road, Nad Al Sheba, Dubai, U.A.E. You can request to change the address, but it must remain within the Meydan Free Zone area only.",
        "Your company license will show: Meydan Grandstand, Next to Meydan Hotel, 6th Floor, Meydan Road, Nad Al Sheba, Dubai, U.A.E. If you need a different address, it can be changed but only to another location within the Meydan Free Zone area.",
        "The standard address is Meydan Grandstand, Next to Meydan Hotel, 6th Floor, Meydan Road, Nad Al Sheba, Dubai, U.A.E. Clients can change this address through an amendment, but the new address must be within the Meydan Free Zone area."
      ],
      "keywords": [
        "company address",
        "license address",
        "meydan address",
        "address on license",
        "business address",
        "registered address",
        "meydan grandstand address",
        "nad al sheba",
        "change address"
      ],
      "source": "FAQ_sheet.pdf",
      "sourceTitle": "Meydan FZ FAQ Sheet"
    },
    {
      "name": "Audit Financial Statement Timing",
      "category": "company_management",
      "question": "When do I need to submit the Audit Financial Statement?",
      "responses": [
        "The Audit Financial Statement Declaration report is required at the time of license renewal. So you need to have it ready before your renewal date. An audited financial report costs AED 3,000 and takes about 14 business days to prepare, so plan accordingly.",
        "You submit the Audit Financial Statement Declaration at license renewal time. Make sure to prepare this in advance — the audit report takes about 14 business days and costs AED 3,000. It's a prerequisite for getting your renewal processed.",
        "The Audit Financial Statement is due at license renewal. Don't leave it to the last minute — the financial audit takes 14 days to complete at AED 3,000. Get it sorted well before your renewal date to avoid delays."
      ],
      "keywords": [
        "audit statement",
        "financial statement timing",
        "when audit",
        "audit renewal",
        "financial declaration",
        "audit submission",
        "when submit audit",
        "audit report deadline"
      ],
      "source": "FAQ_sheet.pdf",
      "sourceTitle": "Meydan FZ FAQ Sheet"
    },
    {
      "name": "LLC to Branch Conversion",
      "category": "company_management",
      "question": "Can I convert LLC to Branch or vice versa?",
      "responses": [
        "No, it's not possible to convert an LLC to a Branch or a Branch to an LLC at Meydan Free Zone. If you need a different company structure, you'd need to set up a new entity. The company also can't provide its own MOA, but you can request additions, removals, or edits to clauses in the Meydan MOA — subject to legal approval.",
        "Converting between LLC and Branch structures isn't possible — you can't go from LLC to Branch or Branch to LLC. If you need a different structure, you'll have to incorporate a new company. On a related note, the MOA is provided by Meydan, though you can request modifications subject to legal review.",
        "Unfortunately, no. You cannot convert an LLC to a Branch or a Branch to an LLC. These are fundamentally different entity types. If your business needs change, you'd need to set up a new company with the desired structure."
      ],
      "keywords": [
        "convert llc branch",
        "llc to branch",
        "branch to llc",
        "change company type",
        "convert entity",
        "company conversion",
        "switch llc",
        "change structure"
      ],
      "source": "FAQ_sheet.pdf",
      "sourceTitle": "Meydan FZ FAQ Sheet"
    },
    {
      "name": "Shop Outside Free Zone",
      "category": "company_management",
      "question": "Can I have a shop outside Meydan Free Zone?",
      "responses": [
        "No, you cannot have a shop outside the Meydan Free Zone area. Your business premises must be within Meydan Free Zone. However, if you need mainland operations, you can apply for a DET (Department of Economy and Tourism) permit — but note that DET permits are not available with General Trading activity. Your company must hold one of the 44 approved mainland activities.",
        "Shops must be within the Meydan Free Zone area only. If you need a physical presence on the mainland, you'll need a DET permit, which allows certain free zone companies to operate in mainland Dubai. Just note: General Trading activity is not eligible for DET permits — you'd need one of the 44 specific mainland activities.",
        "No, your shop must be within the Meydan Free Zone area. For mainland operations, there's the DET permit option, but it requires specific activities (not General Trading). DET permits cover 44 approved mainland activities."
      ],
      "keywords": [
        "shop outside",
        "premises outside",
        "shop mainland",
        "store outside free zone",
        "business outside meydan",
        "det permit",
        "mainland shop",
        "physical shop"
      ],
      "source": "FAQ_sheet.pdf",
      "sourceTitle": "Meydan FZ FAQ Sheet"
    },
    {
      "name": "Chamber of Commerce Certificate",
      "category": "company_management",
      "question": "Will I get a Chamber of Commerce certificate?",
      "responses": [
        "No, a Chamber of Commerce certificate is not automatically issued when you register with Meydan Free Zone. However, Meydan can assist you in registering with Dubai Chambers — that service costs AED 825 (service fee) plus AED 2,200 (authority fee). You'll get portal credentials and a company registration number.",
        "A Chamber of Commerce certificate isn't included with your Meydan FZ registration. But we can help you register with Dubai Chambers for a service fee of AED 825 plus AED 2,200 authority fee. You'll receive a username, password for the portal, and your company registration number.",
        "It's not automatically issued, but Meydan Free Zone can assist you in getting registered with the Chamber of Commerce. The registration costs AED 825 as a service fee plus AED 2,200 as the authority fee. We handle the whole process and provide you with portal access."
      ],
      "keywords": [
        "chamber of commerce",
        "chamber certificate",
        "dubai chambers",
        "chamber registration",
        "commerce certificate",
        "chamber of commerce cost",
        "do i get chamber",
        "chamber membership"
      ],
      "source": "FAQ_sheet.pdf",
      "sourceTitle": "Meydan FZ FAQ Sheet"
    },
    {
      "name": "Property Ownership Under Company",
      "category": "company_management",
      "question": "Can I hold property under my Meydan Free Zone company?",
      "responses": [
        "Yes, you can hold property under your Meydan Free Zone company. This is a great advantage for investors looking to acquire real estate through their business entity in Dubai.",
        "Absolutely — your Meydan Free Zone company can hold property. Many clients use their company structure for property investments in Dubai.",
        "Yes, property ownership under your Meydan Free Zone company is permitted. It's a popular option for investors looking to structure their real estate holdings through a corporate entity."
      ],
      "keywords": [
        "property company",
        "hold property",
        "real estate company",
        "buy property company",
        "property ownership",
        "company property dubai",
        "property under company"
      ],
      "source": "FAQ_sheet.pdf",
      "sourceTitle": "Meydan FZ FAQ Sheet"
    },
    {
      "name": "Visa Allocations Available",
      "category": "company_management",
      "question": "How many visa allocations does a company get?",
      "responses": [
        "Each company gets 6 visa allocations. The visa allocation is the visa quota in immigration and must be obtained before applying for any employment or investor/partner visa. Both the immigration card and visa allocation have the same validity as the business license and need to be renewed annually along with it.",
        "You get 6 visa allocations per company. These represent your immigration visa quota and must be secured before processing any employment or investor visas. The visa allocation validity matches your business license, so they renew together.",
        "6 visa allocations come with your company. This is your immigration quota — required before you can apply for employment or investor/partner visas. Important: visa allocations share the same validity as your license and need annual renewal, even if you obtained them mid-year."
      ],
      "keywords": [
        "visa allocations",
        "how many visas",
        "6 visa",
        "visa quota",
        "number of visas",
        "visa limit",
        "company visa allocation",
        "visa slots"
      ],
      "source": "FAQ_sheet.pdf",
      "sourceTitle": "Meydan FZ FAQ Sheet"
    },
    {
      "name": "Immigration Card Explained",
      "category": "company_management",
      "question": "What is an immigration card?",
      "responses": [
        "The immigration card is what registers your company details in the immigration system. It's mandatory — you must have it before applying for any employment or investor/partner visas. The immigration card has the same validity as your business license and needs to be renewed alongside it. If it expires, there's a penalty of AED 250 per month with no grace period.",
        "An immigration card registers your company in the UAE immigration system. It's a mandatory step that comes before any visa processing — whether employment or investor visas. Its validity matches your business license, and there's no grace period if it expires (AED 250/month penalty).",
        "The immigration card is your company's registration in the immigration system. Think of it as the gateway to visa processing — without it, you can't apply for any employment or investor/partner visas. It shares the same validity as your business license and must be renewed at the same time. No grace period on expiry — penalties start immediately at AED 250/month."
      ],
      "keywords": [
        "immigration card",
        "what is immigration card",
        "immigration card purpose",
        "immigration registration",
        "company immigration",
        "mandatory immigration card",
        "immigration card vs visa",
        "immigration card validity"
      ],
      "source": "FAQ_sheet.pdf",
      "sourceTitle": "Meydan FZ FAQ Sheet"
    },
    {
      "name": "Company Name Change Timeline",
      "category": "company_management",
      "question": "How long does a company name change take?",
      "responses": [
        "A company name change takes 14 days for the publication period. After the name is changed, you must also apply for an immigration card amendment. There are no extra fees if you select 'Renewal with Amendment' during license renewal — unless you're adding a 4th activity group.",
        "The publication period for a company name change amendment is 14 days. Keep in mind you'll need to do an immigration card amendment afterwards too, since it must reflect the new company name. If you're combining the name change with your license renewal, there's no extra fee.",
        "Expect 14 days for a company name change — that's the publication timeline. Important follow-up: you'll need an immigration card amendment to update the name in the immigration system as well. If you do it as a 'Renewal with Amendment', no extra fees apply."
      ],
      "keywords": [
        "name change",
        "company name change",
        "change company name",
        "name change timeline",
        "14 days name",
        "rename company",
        "name amendment",
        "how long name change"
      ],
      "source": "FAQ_sheet.pdf",
      "sourceTitle": "Meydan FZ FAQ Sheet"
    },
    {
      "name": "Company MOA Rules",
      "category": "company_management",
      "question": "Can a company provide its own MOA?",
      "responses": [
        "No, companies can't provide their own Memorandum of Association. Meydan Free Zone provides the standard MOA. However, if you want to add, remove, or edit specific clauses, you can request changes — these will be subject to legal approval. So you have flexibility, just within Meydan's framework.",
        "You can't bring your own MOA — Meydan Free Zone uses its standard Memorandum of Association. But you're not stuck with it as-is. You can request modifications to add, remove, or edit clauses, subject to legal review and approval.",
        "The MOA is provided by Meydan Free Zone — companies cannot submit their own. That said, you can request customizations: adding new clauses, removing existing ones, or editing the language. All changes go through legal approval before being applied."
      ],
      "keywords": [
        "moa",
        "memorandum of association",
        "own moa",
        "custom moa",
        "change moa",
        "modify moa",
        "moa clauses",
        "company moa"
      ],
      "source": "FAQ_sheet.pdf",
      "sourceTitle": "Meydan FZ FAQ Sheet"
    },
    {
      "name": "Renewal with Amendment Fees",
      "category": "company_management",
      "question": "Are there extra fees for renewal with amendment?",
      "responses": [
        "No extra fees when you select 'Renewal with Amendment' during license renewal — unless you're adding a 4th activity group (which costs AED 1,000 per additional activity). Multi-year license holders also get one free amendment included. So most amendments during renewal are essentially free.",
        "Renewal with Amendment doesn't cost extra unless you're adding a 4th activity group. Multi-year license holders get a free amendment built in. It's the most cost-effective way to make changes — bundle them with your renewal.",
        "No extra charges for renewal with amendment. The only exception is if you're adding additional activity groups beyond the initial 3 free ones (AED 1,000 each). If you have a multi-year license, you get one amendment free anyway."
      ],
      "keywords": [
        "renewal amendment fees",
        "renewal with amendment",
        "amendment cost",
        "free amendment",
        "renewal and change",
        "amendment during renewal",
        "change at renewal",
        "amendment extra fees"
      ],
      "source": "FAQ_sheet.pdf",
      "sourceTitle": "Meydan FZ FAQ Sheet"
    },
    {
      "name": "Corporate and Employee Letters Validity",
      "category": "company_management",
      "question": "How long are corporate and employee letters valid?",
      "responses": [
        "Corporate and employee letters from Meydan Free Zone are valid for 30 days from the date of issuance. Board resolutions have a shorter validity of 15 days during application submission on the portal. So make sure to time your document requests accordingly.",
        "The validity is 30 days for both corporate and employee letters. Board resolutions are valid for 15 days during portal application submissions. Plan your timing carefully — don't request letters too far in advance of when you need them.",
        "Corporate letters and employee letters are valid for 30 days. Board resolutions have a 15-day validity window for portal submissions. A corporate letter costs AED 250, employee letter AED 250, and a resolution is AED 350."
      ],
      "keywords": [
        "letter validity",
        "corporate letter validity",
        "employee letter validity",
        "30 days letter",
        "board resolution validity",
        "15 days resolution",
        "how long letter valid",
        "letter expiry"
      ],
      "source": "FAQ_sheet.pdf",
      "sourceTitle": "Meydan FZ FAQ Sheet"
    },
    {
      "name": "Visa Allocation Renewal Rules",
      "category": "company_management",
      "question": "Do visa allocations need annual renewal?",
      "responses": [
        "Yes, visa allocations must be renewed annually along with your business license and immigration card — even if you obtained the visa allocation mid-year. The visa allocation validity matches the license expiry date, not the date it was issued. So it all renews together.",
        "Visa allocations renew every year alongside your license. Even if you got your allocation halfway through the year, it still expires with your license. The immigration card, visa allocation, and business license all share the same validity period and should be renewed together.",
        "Annual renewal is required. The visa allocation validity is tied to your license expiry date — not when you first got it. So even if you availed it mid-year, it expires with your license. Renew your license, immigration card, and visa allocation all at once."
      ],
      "keywords": [
        "visa allocation renewal",
        "renew visa allocation",
        "annual visa renewal",
        "visa allocation expiry",
        "visa allocation validity",
        "mid year visa",
        "visa allocation and license",
        "when renew allocation"
      ],
      "source": "FAQ_sheet.pdf",
      "sourceTitle": "Meydan FZ FAQ Sheet"
    },
    {
      "name": "Immigration Card Amendment After Name Change",
      "category": "company_management",
      "question": "Do I need an immigration card amendment after a name change?",
      "responses": [
        "Yes, the company must apply for an immigration card amendment once the company name is changed. This ensures your immigration records match your updated license. The name change process itself takes 14 days for publication.",
        "Absolutely — an immigration card amendment is required after changing your company name. Your immigration records need to reflect the new name to avoid any issues with visa processing or other immigration-related services.",
        "Yes, it's mandatory. After the company name change (14-day publication period), you need to apply for an immigration card amendment to update the name in the immigration system. Don't skip this step — mismatched records can cause problems."
      ],
      "keywords": [
        "immigration amendment name change",
        "update immigration card",
        "name change immigration",
        "immigration card amendment",
        "amend immigration card",
        "new name immigration"
      ],
      "source": "FAQ_sheet.pdf",
      "sourceTitle": "Meydan FZ FAQ Sheet"
    },
    {
      "name": "Residence Visa and UAE Presence",
      "category": "employee_management",
      "question": "Do I need to be in the UAE to process a residence visa?",
      "responses": [
        "You have the option to start the entry visa process from outside the UAE. However, once the E-visa is issued, you need to be physically inside the UAE to complete the medical fitness test and Emirates ID biometrics. The entry permit is valid for 60 days from issuance, so you have a comfortable window to enter the country.",
        "The initial part can be done remotely — you can apply for the entry visa while outside the country. But once it's issued, you need to enter the UAE within 60 days to complete the medical test and Emirates ID procedures. Those steps require physical presence.",
        "You don't need to be in the UAE to start — the entry visa can be processed while you're abroad. After the E-visa is issued (valid 60 days), you'll need to enter the UAE to complete the medical and Emirates ID steps. Change of status is also valid for 60 days from issuance."
      ],
      "keywords": [
        "residence visa uae presence",
        "need to be in uae",
        "visa processing location",
        "entry visa outside",
        "be in dubai for visa",
        "visa from abroad",
        "process visa remotely",
        "when enter uae"
      ],
      "source": "FAQ_sheet.pdf",
      "sourceTitle": "Meydan FZ FAQ Sheet"
    },
    {
      "name": "Entry Visa and Change of Status Validity",
      "category": "employee_management",
      "question": "How long is the entry visa and change of status valid?",
      "responses": [
        "Both the entry permit and change of status are valid for 60 days from the date of issuance. That gives you a comfortable window to enter the UAE and complete the medical test and Emirates ID procedures. Visa stamping is no longer mandatory — the electronic version suffices as residency proof.",
        "The entry visa is valid for 60 days from issuance, and change of status is also 60 days. Fun fact: physical visa stamping in your passport is no longer required under new UAE regulations. The electronic version serves as valid residency proof.",
        "60 days for both. Your entry permit gives you 60 days to enter the UAE, and change of status is similarly valid for 60 days. Also good to know: visa stamping is optional now — the UAE has moved to electronic residency proof."
      ],
      "keywords": [
        "entry visa validity",
        "60 days visa",
        "change of status validity",
        "how long entry visa",
        "e-visa validity",
        "visa stamping",
        "electronic visa",
        "entry permit duration"
      ],
      "source": "FAQ_sheet.pdf",
      "sourceTitle": "Meydan FZ FAQ Sheet"
    },
    {
      "name": "Passport Submission for Visa",
      "category": "employee_management",
      "question": "Do I need to submit my original passport for a visa?",
      "responses": [
        "No, visa stamping is no longer mandatory as per the new UAE regulations. The electronic version of your visa suffices as residency proof. You don't need to hand over your original passport for the process.",
        "Nope — under new UAE regulations, physical visa stamping isn't required anymore. Your electronic visa serves as valid residency proof. So your original passport stays safely with you throughout the process.",
        "You no longer need to submit your original passport. The UAE has moved away from mandatory visa stamping — the electronic version is now accepted as proof of residency. This makes the whole process much more convenient."
      ],
      "keywords": [
        "original passport",
        "submit passport",
        "passport visa",
        "visa stamping passport",
        "passport required",
        "hand over passport",
        "passport submission",
        "electronic visa stamp"
      ],
      "source": "FAQ_sheet.pdf",
      "sourceTitle": "Meydan FZ FAQ Sheet"
    },
    {
      "name": "Residence Visa Before Biometrics",
      "category": "employee_management",
      "question": "Can I get my residence visa before completing biometrics?",
      "responses": [
        "Yes, you can submit the Residence Visa application through the portal and fill out and sign the Emirates ID declaration form to proceed with visa issuance before biometrics. Once the visa is issued, you have 60 days to complete the biometrics.",
        "You can get the residence visa issued before biometrics by signing the Emirates ID declaration form. This speeds up the process significantly. Just remember — you must complete biometrics within 60 days of the visa issuance.",
        "Yes! Submit your visa application through the portal and sign the Emirates ID declaration form. Your residence visa can then be issued before completing biometrics. You'll have a 60-day window to get the biometrics done after visa issuance."
      ],
      "keywords": [
        "visa before biometrics",
        "biometrics timeline",
        "60 days biometrics",
        "skip biometrics first",
        "residence visa biometrics",
        "eid declaration form",
        "biometrics deadline",
        "visa without biometrics"
      ],
      "source": "FAQ_sheet.pdf",
      "sourceTitle": "Meydan FZ FAQ Sheet"
    },
    {
      "name": "Investor Visa Age and Requirements",
      "category": "employee_management",
      "question": "What are the age requirements for an investor/partner visa?",
      "responses": [
        "The minimum age for an investor/partner visa is 18 years, with no maximum age limit. You must have AED 50,000 share capital in the company to qualify. Before applying, make sure you have your immigration card and visa allocation in place.",
        "You need to be at least 18 years old for an investor/partner visa — there's no upper age limit. The key requirement is AED 50,000 in share capital in the company. Also ensure your immigration card and visa allocation are set up before applying.",
        "Minimum 18 years, no maximum age. The main financial requirement is AED 50,000 share capital in the company. Age isn't the barrier here — just meet the capital requirement and have your immigration card and visa allocation ready."
      ],
      "keywords": [
        "investor visa age",
        "partner visa age",
        "minimum age investor",
        "maximum age investor",
        "50000 share capital",
        "investor visa requirements",
        "partner visa requirements",
        "age limit investor visa"
      ],
      "source": "FAQ_sheet.pdf",
      "sourceTitle": "Meydan FZ FAQ Sheet"
    },
    {
      "name": "Employee Visa Age Requirements",
      "category": "employee_management",
      "question": "What are the age requirements for an employee visa?",
      "responses": [
        "The minimum age for an employee visa is 18 years and the maximum is 60 years. Within that range, any employee can be sponsored under your company's visa allocation. Make sure your immigration card and visa allocation are in place before applying.",
        "Employee visas require the applicant to be between 18 and 60 years old. That's the age window for employment visa eligibility at Meydan Free Zone. The immigration card and visa allocation must be active before processing.",
        "Age range for employee visas: 18 to 60 years. Below 18 or above 60 doesn't qualify for an employment visa. Your company needs an active immigration card and visa allocation before you can submit the application."
      ],
      "keywords": [
        "employee visa age",
        "minimum age employee",
        "maximum age employee",
        "18 60 employee visa",
        "age limit employee",
        "employee visa requirements",
        "staff visa age",
        "worker visa age"
      ],
      "source": "FAQ_sheet.pdf",
      "sourceTitle": "Meydan FZ FAQ Sheet"
    },
    {
      "name": "Meydan Office Hours and Location",
      "category": "general_info",
      "question": "What are Meydan's office hours and where is the office?",
      "responses": [
        "Meydan Free Zone operates 24/7 — we're always available. The office is located at Meydan Grandstand, 6th Floor, next to Meydan Hotel, Meydan Road, Nad Al Sheba 1, Dubai, UAE. The share desk office is at the same location. Our portal is accessible around the clock for application submissions and tracking.",
        "We're open 24/7! The office is at Meydan Grandstand, 6th Floor, next to Meydan Hotel, Meydan Road, Nad Al Sheba 1, Dubai, UAE. Whether you need in-person service or online support, we're available round the clock.",
        "Meydan Free Zone is operational 24 hours a day, 7 days a week. You can visit us at Meydan Grandstand, 6th Floor, Meydan Road, next to Meydan Hotel, Nad Al Sheba 1, Dubai, UAE. The share desk office is in the same building."
      ],
      "keywords": [
        "office hours",
        "office timing",
        "office location",
        "meydan address",
        "where is meydan",
        "24/7",
        "meydan grandstand",
        "nad al sheba",
        "office open",
        "working hours",
        "meydan office"
      ],
      "source": "FAQ_sheet.pdf",
      "sourceTitle": "Meydan FZ FAQ Sheet"
    },
    {
      "name": "Using Meydan PO Box and Mail",
      "category": "general_info",
      "question": "Can I use Meydan's PO Box or receive packages at the office?",
      "responses": [
        "You cannot use Meydan's PO Box number — you'll need to apply for your own through Meydan Plus (costs AED 1,700). As for deliveries, Meydan Free Zone will not receive any goods or packages on your behalf unless you're registered for the Mail Management service (AED 750). With Mail Management, you get a shared PO Box and email notifications when mail arrives.",
        "Meydan's own PO Box isn't available for client use. But you can get your own PO Box through Meydan Plus for AED 1,700. Similarly, the office won't accept deliveries for you unless you've signed up for Mail Management at AED 750. That gives you a shared PO Box and email alerts when you've got mail.",
        "No to both by default. You can't use Meydan's PO Box — apply for your own at AED 1,700. And packages won't be accepted at the office unless you have the Mail Management service (AED 750), which includes a shared PO Box and email notifications for incoming mail."
      ],
      "keywords": [
        "meydan po box",
        "use meydan po box",
        "receive packages",
        "delivery meydan",
        "mail meydan office",
        "packages meydan",
        "goods delivery",
        "meydan mail service"
      ],
      "source": "FAQ_sheet.pdf",
      "sourceTitle": "Meydan FZ FAQ Sheet"
    },
    {
      "name": "DET Permit Eligibility",
      "category": "company_management",
      "question": "Can I get a DET permit with General Trading activity?",
      "responses": [
        "No, you cannot get a DET (Department of Economy and Tourism) permit with General Trading activity. Your company must hold one of the 44 specific mainland activities approved for DET permits. A DET permit allows free zone companies to operate on the mainland, but the activity restriction is strict.",
        "DET permits are not available for General Trading activity. You need one of the 44 approved mainland activities to qualify. If you want mainland operations, check if your current activities align with the DET-eligible list, or consider adding an eligible activity to your license.",
        "No — General Trading doesn't qualify for a DET permit. The company must have one of the 44 designated mainland activities. DET permits let free zone companies operate in mainland Dubai, but the activity eligibility is specific."
      ],
      "keywords": [
        "det permit",
        "general trading det",
        "mainland permit",
        "det eligibility",
        "44 mainland activities",
        "det general trading",
        "operate mainland",
        "det allowed activities"
      ],
      "source": "FAQ_sheet.pdf",
      "sourceTitle": "Meydan FZ FAQ Sheet"
    },
    {
      "name": "License Package Cost",
      "question": "How much does a Meydan Free Zone license cost?",
      "responses": [
        "A new corporate license at Meydan Free Zone is AED 12,125. That's an all-in package — it covers your company formation, the trade license itself, one visa allocation, and a flexi desk. You also get 3 business activities included, so you're pretty much set to start operating right away.",
        "The license package is AED 12,125, and honestly it's great value because it bundles everything together — formation, license, visa allocation, and flexi desk, plus 3 business activities. Renewal is the same price. No hidden costs.",
        "It's AED 12,125 for a new license, which includes formation, the license, a visa allocation, and flexi desk — all packaged together. You get up to 3 business activities included in that price. Same cost applies when you renew."
      ],
      "keywords": [
        "license cost",
        "how much is a license",
        "license price",
        "trade license fee",
        "cost of license meydan",
        "license package price",
        "12125",
        "what does a license cost",
        "meydan license fee",
        "corporate license price",
        "new license price",
        "license charges"
      ],
      "source": "price-list.pdf",
      "sourceTitle": "Meydan FZ Price List"
    },
    {
      "name": "License Renewal Cost",
      "question": "How much does it cost to renew my license?",
      "responses": [
        "License renewal is AED 12,125 — same as a new license. It includes your license, visa allocation, and flexi desk. And here's a nice perk: if you need any amendments done at renewal time, those are completely free.",
        "Renewal is AED 12,125. Same package deal — license, visa allocation, flexi desk, 3 activities. The good news? If you want to make changes like updating your business activities or shareholders, amendments at renewal are free of charge.",
        "It's AED 12,125 to renew, identical to the new license cost. Everything's included — license, visa, flexi desk. Pro tip: time your amendments with your renewal since they're free at that point."
      ],
      "keywords": [
        "license renewal cost",
        "renew license price",
        "renewal fee",
        "license renewal charges",
        "how much to renew",
        "annual renewal cost",
        "renewal price meydan",
        "renew my license",
        "license renewal"
      ],
      "source": "price-list.pdf",
      "sourceTitle": "Meydan FZ Price List"
    },
    {
      "name": "What's Included in License Package",
      "question": "What's included in the Meydan Free Zone license package?",
      "responses": [
        "Your license package includes everything you need to get started: company formation, the trade license, one visa allocation, a flexi desk, and 3 business activities. It's AED 12,125 all-in. You literally just need to submit your documents and you're up and running.",
        "The AED 12,125 package bundles it all — formation of your company, the actual trade license, a visa allocation so you can sponsor employees, a flexi desk for your workspace, and 3 business activities. It's designed so you don't have to pay for things separately.",
        "For AED 12,125 you get: company formation, trade license, one visa allocation, flexi desk access, and 3 business activities included. It's a complete startup package. If you need more activities or visas, those can be added separately."
      ],
      "keywords": [
        "what's included in license",
        "license package includes",
        "what do I get with license",
        "license inclusions",
        "package contents",
        "what comes with the license",
        "license benefits",
        "license package details",
        "flexi desk included"
      ],
      "source": "price-list.pdf",
      "sourceTitle": "Meydan FZ Price List"
    },
    {
      "name": "License Amendment Cost",
      "question": "How much does a license amendment cost?",
      "responses": [
        "A license amendment is AED 2,000. But here's a tip — if you time your amendment with your license renewal, it's completely free. So if your renewal is coming up, it's worth waiting a bit to save that 2,000.",
        "It's AED 2,000 for a license amendment. However, if you do it at the same time as your license renewal, there's no charge at all. Same goes if you combine it with formation — AED 0 at renewal time.",
        "License amendments cost AED 2,000. Quick tip though: amendments are free if done during renewal. So unless it's urgent, you might want to bundle it with your next renewal cycle."
      ],
      "keywords": [
        "license amendment cost",
        "amendment fee",
        "change license cost",
        "modify license",
        "license amendment price",
        "amend license",
        "amendment charges",
        "license change fee",
        "2000 amendment"
      ],
      "source": "price-list.pdf",
      "sourceTitle": "Meydan FZ Price List"
    },
    {
      "name": "Additional Business Activity Cost",
      "question": "How much does it cost to add more business activities?",
      "responses": [
        "Adding an extra business activity is AED 1,000 each. Remember, your license already comes with 3 activities included. So you only pay for the 4th one onwards. Removing or editing an activity is also treated as an amendment at AED 1,000.",
        "It's AED 1,000 per additional business activity. Your standard license includes 3 activities for free, so you'd only need this if you want a 4th, 5th, etc. Just note — even removing an activity counts as an amendment at the same price.",
        "Each additional business activity costs AED 1,000. Since the license already covers 3 activities, most clients don't need extras. But if your business expands into new areas, it's a straightforward AED 1,000 per activity to add."
      ],
      "keywords": [
        "additional business activity",
        "add activity cost",
        "extra activity price",
        "business activity fee",
        "more activities",
        "4th activity cost",
        "add new activity",
        "additional activity charges",
        "1000 activity"
      ],
      "source": "price-list.pdf",
      "sourceTitle": "Meydan FZ Price List"
    },
    {
      "name": "Shareholder Limits and Extra Fees",
      "question": "How many shareholders can I have and is there an extra cost?",
      "responses": [
        "You can have up to 50 shareholders on your license. The first 6 are included in your standard package at no extra cost. From the 7th shareholder onwards, it's AED 2,000 per additional shareholder. Most small businesses are well within the 6 included.",
        "Up to 50 shareholders are allowed. The first 6 come at no additional charge — you only start paying AED 2,000 per shareholder from number 7 onwards. So for most companies, there's no extra shareholder cost at all.",
        "Meydan allows a maximum of 50 shareholders per license. Six shareholders are included for free. After that, each additional shareholder is AED 2,000. If you're a small team, you're covered without any extra fees."
      ],
      "keywords": [
        "how many shareholders",
        "shareholder limit",
        "extra shareholder cost",
        "maximum shareholders",
        "shareholder fee",
        "additional shareholder",
        "number of shareholders",
        "shareholder charges",
        "6 shareholders",
        "50 shareholders"
      ],
      "source": "price-list.pdf",
      "sourceTitle": "Meydan FZ Price List"
    },
    {
      "name": "Employment Visa Cost",
      "question": "How much does an employment visa cost?",
      "responses": [
        "A new employment visa is AED 3,500, and renewal is the same — AED 3,500. Cancellation is AED 800. If you need it processed urgently, there's an additional AED 1,000 urgent service fee. The visa covers your employee's residency in the UAE.",
        "Employment visa is AED 3,500 for new and AED 3,500 for renewal. If you ever need to cancel, that's AED 800. For urgent processing, add AED 1,000 to the base fee. Pretty standard across free zones, and Meydan handles the whole process for you.",
        "It's AED 3,500 for a new employment visa, same for renewal. Cancellation costs AED 800. Need it fast? The urgent service is an extra AED 1,000. This covers the full residence visa for your employee."
      ],
      "keywords": [
        "employment visa cost",
        "employee visa price",
        "visa fee",
        "how much is employment visa",
        "work visa cost",
        "residence visa cost",
        "new visa price",
        "visa charges",
        "3500 visa",
        "employee visa fee",
        "employment visa"
      ],
      "source": "price-list.pdf",
      "sourceTitle": "Meydan FZ Price List"
    },
    {
      "name": "Investor Partner Visa Cost",
      "question": "How much does an investor or partner visa cost?",
      "responses": [
        "An investor or partner visa is AED 4,000 for new issuance, and the same AED 4,000 for renewal. Cancellation is AED 800. It's a bit more than the employment visa because it carries investor/partner status, which gives you additional benefits.",
        "The investor/partner visa is AED 4,000 — both for new and renewal. Cancellation is AED 800 if needed. This is the visa you'd get as a business owner or shareholder in the company. Slightly higher than employee visa but comes with partner status.",
        "It costs AED 4,000 for a new investor or partner visa, same for renewal. If you need to cancel down the line, that's AED 800. As a shareholder or investor, this is the visa type you'll be applying for."
      ],
      "keywords": [
        "investor visa cost",
        "partner visa price",
        "investor visa fee",
        "partner visa cost",
        "shareholder visa",
        "owner visa cost",
        "4000 visa",
        "investor partner visa",
        "business owner visa"
      ],
      "source": "price-list.pdf",
      "sourceTitle": "Meydan FZ Price List"
    },
    {
      "name": "Visa Allocation Cost",
      "question": "How much does a visa allocation cost?",
      "responses": [
        "Visa allocation is AED 1,850 per allocation. But if you need bulk allocations, there are discounts — for 50 or more, it drops to AED 1,000 each, and for 500 or more, it's just AED 950 each. One visa allocation is already included in your license package.",
        "Each visa allocation costs AED 1,850. Volume discounts kick in at 50+ allocations (AED 1,000 each) and 500+ allocations (AED 950 each). Remember, your license package already includes one allocation, so you're only paying for additional ones.",
        "It's AED 1,850 per visa allocation. Good news is there are bulk rates — AED 1,000 per allocation when you get 50+, and AED 950 per allocation at 500+. Your initial license package comes with one allocation included."
      ],
      "keywords": [
        "visa allocation cost",
        "visa allocation price",
        "how much visa allocation",
        "visa allocation fee",
        "per visa cost",
        "visa quota price",
        "1850 visa",
        "bulk visa discount",
        "visa allocation charges"
      ],
      "source": "price-list.pdf",
      "sourceTitle": "Meydan FZ Price List"
    },
    {
      "name": "Dependent Visa Cost",
      "question": "How much does a dependent visa cost?",
      "responses": [
        "A dependent visa is AED 6,000 — that's an all-inclusive price covering entry permit, change of status if applicable, stamping, medical, and Emirates ID. Renewal is also AED 6,000. Cancellation is AED 1,000. For investor/partner sponsors, there's a AED 3,000 deposit per dependent. Employee sponsors have no deposit.",
        "Dependent visa runs AED 6,000 for new and AED 6,000 for renewal. This is a complete package — entry, status change, stamping, medical, EID, everything handled. Cancellation is AED 1,000. If you're on an investor/partner visa, there's a AED 3,000 refundable deposit per dependent. Employees don't need the deposit.",
        "It's AED 6,000 for a new dependent visa and the same for renewal. That covers the whole process — entry permit, medical, Emirates ID, stamping, everything. If you're an investor or partner, you'll also need a AED 3,000 deposit per dependent. If you're on an employment visa, no deposit needed. Cancellation is AED 1,000."
      ],
      "keywords": [
        "dependent visa cost",
        "family visa price",
        "spouse visa cost",
        "dependant visa fee",
        "dependent visa meydan",
        "6000 dependent",
        "family visa fee",
        "children visa cost",
        "wife visa cost",
        "husband visa",
        "dependent visa charges"
      ],
      "source": "price-list.pdf",
      "sourceTitle": "Meydan FZ Price List"
    },
    {
      "name": "Temporary Work Permit Options",
      "question": "What are the temporary work permit options and costs?",
      "responses": [
        "We have temporary work permits for different durations: 21 days is AED 1,000, 1 month is AED 1,350, 3 months is AED 2,000, 6 months is AED 2,500, and 12 months is AED 3,400. These are great if you need someone working for a short project without going through the full visa process.",
        "Temporary work permits start at AED 1,000 for 21 days, then AED 1,350 for 1 month, AED 2,000 for 3 months, AED 2,500 for 6 months, and AED 3,400 for 12 months. They're ideal for short-term hires, project-based workers, or while you're waiting for a full visa to process.",
        "Here are the work permit options: 21 days — AED 1,000, 1 month — AED 1,350, 3 months — AED 2,000, 6 months — AED 2,500, and a full year at AED 3,400. Perfect for contractors or temporary staff. Much faster to process than a full employment visa."
      ],
      "keywords": [
        "temporary work permit",
        "work permit cost",
        "short term work permit",
        "temporary permit price",
        "21 day permit",
        "3 month work permit",
        "work permit options",
        "temporary employee",
        "project work permit",
        "work permit meydan"
      ],
      "source": "price-list.pdf",
      "sourceTitle": "Meydan FZ Price List"
    },
    {
      "name": "Office Options and Pricing",
      "question": "What office options does Meydan Free Zone offer?",
      "responses": [
        "We have several options depending on your needs. Co-working shared desk is AED 375 for 4 hours. Dedicated desk is AED 3,500 per month. Shared office is AED 15,000 per year. Dedicated office is AED 30,000 per year and includes phone answering, mail management, and 3 hours of meeting room. There's also a flexi desk included free with your license package.",
        "Here's the full range: Flexi desk comes free with your license. Co-working shared desk is AED 375 for 4 hours if you need a drop-in space. Dedicated desk is AED 3,500/month for a permanent spot. Shared office is AED 15,000/year. And a dedicated private office is AED 30,000/year — that one includes phone answering, mail management, and meeting room access.",
        "Meydan offers everything from a basic flexi desk (included free in your license) all the way to a dedicated private office at AED 30,000/year. In between, you've got shared co-working at AED 375 for 4 hours, dedicated desk at AED 3,500/month, and shared office at AED 15,000/year. The dedicated office comes with extra perks — dedicated phone answering, mail management, and 3 hours of meeting room."
      ],
      "keywords": [
        "office options",
        "office pricing",
        "office cost",
        "workspace meydan",
        "co-working desk",
        "shared office price",
        "dedicated office cost",
        "flexi desk",
        "office facilities",
        "workspace options",
        "office space meydan",
        "desk options",
        "hot desk",
        "co-working price"
      ],
      "source": "price-list.pdf",
      "sourceTitle": "Meydan FZ Price List"
    },
    {
      "name": "Grandstand Business Center Offices",
      "question": "What about the Grandstand Business Center offices?",
      "responses": [
        "The Grandstand Business Center has dedicated offices ranging from AED 35,000 to AED 210,000 per year, depending on the size and visa allocations. They come with 2 to 14 free visa allocations, 6 to 14 workstations, and free meeting room hours. We also have a dedicated desk option at AED 7,000/year and shared office at AED 20,000/year.",
        "Grandstand offices are our premium option. Dedicated offices start at AED 35,000/year for a 2-desk office with 6 visa allocations, going up to AED 210,000/year for a 10-desk setup with 14 visa allocations. Each office includes free meeting hours. There's also a dedicated desk at AED 7,000/year or a shared office at AED 20,000/year if you want something smaller.",
        "The Grandstand Business Center is our physical office space at Meydan Hotel. Prices range from AED 35,000 to AED 210,000 annually depending on the office size. The bigger offices come with more free visa allocations and workstations. For example, office 651 has 10 workstations, 14 visa allocations, and 10 free meeting hours per month at AED 210,000/year."
      ],
      "keywords": [
        "grandstand office",
        "business center",
        "physical office meydan",
        "grandstand pricing",
        "meydan office space",
        "office at meydan hotel",
        "grandstand business center",
        "premium office",
        "dedicated office grandstand",
        "office 651"
      ],
      "source": "price-list.pdf",
      "sourceTitle": "Meydan FZ Price List"
    },
    {
      "name": "Meeting Room Cost",
      "question": "How much does a meeting room cost?",
      "responses": [
        "Meeting rooms are AED 150 per hour through Meydan+ services. If you'd prefer a monthly arrangement, there's also a meeting room facility at AED 6,500 per month. Amendment and cancellation of meeting room bookings are free.",
        "It's AED 150 per hour for meeting room rental. If you use meeting rooms frequently, the monthly option at AED 6,500 might be more cost-effective. Booking changes and cancellations come at no charge.",
        "Meeting rooms cost AED 150/hour. For regular users, there's a monthly package at AED 6,500. If you have a Grandstand dedicated office, you already get free meeting hours included in your lease — ranges from 2 to 10 hours per month depending on the office."
      ],
      "keywords": [
        "meeting room cost",
        "meeting room price",
        "meeting room hourly rate",
        "conference room",
        "meeting room rental",
        "meeting room booking",
        "150 per hour meeting",
        "meeting room meydan",
        "book meeting room"
      ],
      "source": "price-list.pdf",
      "sourceTitle": "Meydan FZ Price List"
    },
    {
      "name": "Immigration Card Cost",
      "question": "How much does an immigration card cost?",
      "responses": [
        "A new immigration card is AED 2,000, renewal is AED 2,200, and amendment or cancellation is AED 2,000 each. It's also called an establishment card — basically your company's immigration identity. Watch out for late renewal — there's a AED 250 penalty per month after expiry.",
        "Immigration card — also known as establishment card — costs AED 2,000 new, AED 2,200 for renewal, and AED 2,000 for any amendments or cancellation. Make sure to renew on time because late fees are AED 250 per month after the expiry date.",
        "The establishment or immigration card is AED 2,000 for a new one, AED 2,200 to renew, and AED 2,000 if you need to amend or cancel. One thing to note: if you're late on renewal, it's AED 250 per month penalty, so best to set a reminder."
      ],
      "keywords": [
        "immigration card cost",
        "establishment card price",
        "immigration card fee",
        "establishment card renewal",
        "immigration card renewal",
        "2000 immigration card",
        "establishment card meydan",
        "immigration card charges"
      ],
      "source": "price-list.pdf",
      "sourceTitle": "Meydan FZ Price List"
    },
    {
      "name": "Medical and Emirates ID Assistance",
      "question": "Do you help with medical and Emirates ID processing?",
      "responses": [
        "Absolutely! Through Meydan+ we handle the whole thing. Medical and Emirates ID together is AED 2,250 — includes home pick-up, VIP medical, and Emirates ID fee. If you need them separately: medical assistance alone is AED 2,000, and Emirates ID alone is AED 750. For urgent Emirates ID processing with biometrics appointment, it's AED 1,250, or AED 2,750 with medical included.",
        "Yes, Meydan+ has you covered. The combined medical and Emirates ID package is AED 2,250, which includes home pick-up, VIP medical, and the EID fee. Medical only is AED 2,000, EID only is AED 750. Need it done fast? Urgent EID is AED 1,250, or AED 2,750 for urgent medical + EID with biometrics appointment.",
        "We do! Meydan+ offers full assistance — medical and EID combined for AED 2,250 with home pick-up and VIP treatment. You can also get them separately: AED 2,000 for medical, AED 750 for Emirates ID. For urgent processing including biometrics appointment, it's AED 2,750 for the full package or AED 1,250 for just the urgent EID."
      ],
      "keywords": [
        "medical assistance",
        "emirates ID help",
        "EID processing",
        "medical test visa",
        "medical and EID cost",
        "emirates ID fee",
        "medical exam",
        "biometrics appointment",
        "VIP medical",
        "home pick up medical",
        "2250 medical EID"
      ],
      "source": "price-list.pdf",
      "sourceTitle": "Meydan FZ Price List"
    },
    {
      "name": "Medical Insurance Options",
      "question": "What are the medical insurance options and costs?",
      "responses": [
        "Meydan+ offers medical insurance in 4 categories: Category A is AED 1,400 for investors and employees with salary above AED 4,000. Category B is AED 900 for employees with salary below AED 4,000. Category C is AED 1,200 for dependents like children. Category D is AED 2,700 for dependent housewives. Medical insurance is mandatory for all visa holders in the UAE.",
        "We have 4 tiers: Cat A — AED 1,400 for investors and higher-salary employees (above 4K). Cat B — AED 900 for employees earning below AED 4,000. Cat C — AED 1,200 for dependent children and others. Cat D — AED 2,700 for dependent housewives. Every visa holder needs medical insurance, so this is a must-have.",
        "Medical insurance through Meydan+ comes in 4 categories based on your status: Investors and employees earning above AED 4,000 — AED 1,400. Employees below AED 4,000 salary — AED 900. Dependent child/other — AED 1,200. Dependent housewife — AED 2,700. It's mandatory in the UAE for all residents."
      ],
      "keywords": [
        "medical insurance cost",
        "health insurance meydan",
        "insurance categories",
        "medical insurance price",
        "employee insurance",
        "dependent insurance",
        "category A insurance",
        "mandatory insurance",
        "health cover cost",
        "medical insurance options"
      ],
      "source": "price-list.pdf",
      "sourceTitle": "Meydan FZ Price List"
    },
    {
      "name": "PO Box Service",
      "question": "Can I get a PO Box with Meydan?",
      "responses": [
        "Yes! A PO Box through Meydan+ is AED 1,700 for new setup and the same AED 1,700 for annual renewal. Cancellation is AED 500. This gives you a physical mailing address for your business correspondence.",
        "Definitely. PO Box service costs AED 1,700 new and AED 1,700 per year for renewal. If you need to cancel, that's AED 500. It's great for having a professional mailing address for your company.",
        "Meydan+ offers PO Box at AED 1,700 per year, same for initial setup and renewal. Cancellation fee is AED 500. A lot of clients combine this with mail management service at AED 750/year so someone handles receiving and organizing your mail."
      ],
      "keywords": [
        "po box cost",
        "po box meydan",
        "mailing address",
        "po box price",
        "po box service",
        "1700 po box",
        "postal box",
        "meydan po box",
        "po box fee",
        "business mailing address"
      ],
      "source": "price-list.pdf",
      "sourceTitle": "Meydan FZ Price List"
    },
    {
      "name": "Phone Answering Service",
      "question": "What is the phone answering service?",
      "responses": [
        "Meydan+ offers a dedicated phone answering service with a Dubai 04 number for AED 3,775 per year. You get a professional receptionist answering calls in your company name, and calls can be forwarded to your mobile. There's a AED 2,000 refundable deposit for call forwarding charges. Amendment and cancellation are free.",
        "It's a dedicated phone answering service — you get your own 04 Dubai landline number with a professional team answering calls on behalf of your company. Costs AED 3,775/year. There's a AED 2,000 security deposit for call forwarding (local and international charges apply per UAE telecom rates). Amendments and cancellations are at no charge.",
        "The phone answering service gives your business a dedicated Dubai 04 number for AED 3,775/year. A professional team answers calls in your company name and forwards them to you. Setup and renewal are the same price. You'll need a AED 2,000 deposit for the call forwarding feature. It's great for looking professional without hiring a receptionist."
      ],
      "keywords": [
        "phone answering service",
        "dedicated phone number",
        "04 number",
        "phone answering cost",
        "receptionist service",
        "business phone",
        "phone answering meydan",
        "3775 phone",
        "virtual receptionist",
        "dubai phone number",
        "landline number"
      ],
      "source": "price-list.pdf",
      "sourceTitle": "Meydan FZ Price List"
    },
    {
      "name": "VAT Registration",
      "question": "Can Meydan help with VAT registration?",
      "responses": [
        "Yes, Meydan+ handles VAT registration for AED 1,500. Whether it's a new registration, amendment, or de-registration (cancellation), each is AED 1,500. They take care of the whole process with the Federal Tax Authority on your behalf.",
        "Absolutely. VAT registration through Meydan+ is AED 1,500 for new registration, amendments, or cancellation. They handle everything with the FTA. If you've hit the mandatory threshold of AED 375,000 in taxable supplies, you need to register.",
        "Meydan+ does VAT registration at AED 1,500 each for new, amendment, or de-registration. The team handles the FTA submission for you. Super straightforward — just provide your financial details and they do the rest."
      ],
      "keywords": [
        "VAT registration",
        "VAT registration cost",
        "register for VAT",
        "VAT help",
        "VAT filing",
        "VAT meydan",
        "1500 VAT",
        "tax registration",
        "FTA registration",
        "VAT de-registration"
      ],
      "source": "price-list.pdf",
      "sourceTitle": "Meydan FZ Price List"
    },
    {
      "name": "Corporate Tax Starter Package",
      "question": "Do you offer corporate tax services?",
      "responses": [
        "Yes! The Corporate Tax Starter Package through Meydan+ is AED 1,200. This helps you get set up with UAE corporate tax requirements. For more comprehensive support, there's also the CT 300 package and CT deregistration services. The compliance team can guide you through what's needed based on your business size.",
        "Meydan+ offers a Corporate Tax Starter Package for AED 1,200 to help you comply with UAE corporate tax regulations. For ongoing compliance, there's also the Compliance Notification Filing at AED 1,300 and Compliance Assessment at AED 1,800. These cover ESR, GO AML, UBO, and other regulatory submissions.",
        "Absolutely. The CT Starter package is AED 1,200 through Meydan+. For businesses with more complex needs, there's the ESR Comprehensive Assessment at AED 5,250 which involves a deep dive into financial transactions. Compliance Notification Filing is AED 1,300 for authority portal submissions."
      ],
      "keywords": [
        "corporate tax",
        "corporate tax package",
        "CT starter",
        "tax services meydan",
        "corporate tax help",
        "tax compliance",
        "1200 tax",
        "corporate tax registration",
        "UAE corporate tax",
        "tax starter package"
      ],
      "source": "price-list.pdf",
      "sourceTitle": "Meydan FZ Price List"
    },
    {
      "name": "Bookkeeping Services",
      "question": "Does Meydan offer bookkeeping services?",
      "responses": [
        "Yes! Through Meydan+, bookkeeping is available in two tiers: Category A is AED 1,000 per month, and Category B is AED 1,500 per month for more complex needs. They also offer financial audit reports at AED 3,000 and liquidation reports at AED 1,000.",
        "Meydan+ offers bookkeeping at AED 1,000/month for Category A and AED 1,500/month for Category B, depending on the complexity of your accounts. If you need an audit, the financial audit report is AED 3,000. They handle everything so you can focus on your business.",
        "Bookkeeping through Meydan+ starts at AED 1,000 per month for Category A and AED 1,500 per month for Category B. It's a hassle-free way to keep your books in order. They also do financial audit reports for AED 3,000 if you need them."
      ],
      "keywords": [
        "bookkeeping cost",
        "bookkeeping service",
        "accounting service",
        "bookkeeping meydan",
        "monthly bookkeeping",
        "accounting help",
        "financial records",
        "bookkeeping price",
        "1000 bookkeeping",
        "accounting meydan"
      ],
      "source": "price-list.pdf",
      "sourceTitle": "Meydan FZ Price List"
    },
    {
      "name": "MOFA Attestation",
      "question": "How much does MOFA attestation cost?",
      "responses": [
        "MOFA attestation through Meydan+ is AED 575 for individual documents and AED 2,900 for corporate documents. The team handles the whole process — you just provide the documents and they take care of the Ministry of Foreign Affairs attestation.",
        "Individual MOFA attestation is AED 575, and corporate attestation is AED 2,900. This is for getting your documents officially attested by the Ministry of Foreign Affairs, which is required for various legal and business processes.",
        "Through Meydan+ services: MOFA attestation for individual documents is AED 575, and for corporate documents it's AED 2,900. They also do document legal translation at AED 250 per page if you need that alongside the attestation."
      ],
      "keywords": [
        "MOFA attestation",
        "MOFA cost",
        "attestation price",
        "ministry foreign affairs",
        "document attestation",
        "MOFA fee",
        "corporate attestation",
        "individual attestation",
        "MOFA meydan",
        "575 attestation"
      ],
      "source": "price-list.pdf",
      "sourceTitle": "Meydan FZ Price List"
    },
    {
      "name": "DET Permit for Mainland Operations",
      "question": "Can I operate in Dubai mainland with a free zone license?",
      "responses": [
        "Yes, you can! You'll need a DET (Department of Economy and Tourism) permit, which costs AED 9,500 through Meydan+. This covers one activity as confirmed by DET. If you need additional activities, each one is AED 5,000. Renewal is also AED 9,500 per year.",
        "Absolutely — with a DET permit you can operate on the mainland. The approval through Meydan+ is AED 9,500, which covers one activity. Additional activities under the DET permit are AED 5,000 each. It's renewed annually at AED 9,500.",
        "You can! Meydan+ helps you get DET approval to operate in Dubai mainland for AED 9,500. That covers one business activity. Need more activities? Each additional one is AED 5,000 on top. The permit renews annually at the same price."
      ],
      "keywords": [
        "DET permit",
        "mainland operations",
        "operate mainland",
        "DED approval",
        "free zone mainland",
        "DET cost",
        "9500 DET",
        "dual license",
        "mainland permit",
        "dubai mainland",
        "department of economy",
        "DET approval"
      ],
      "source": "price-list.pdf",
      "sourceTitle": "Meydan FZ Price List"
    },
    {
      "name": "Customs Code",
      "question": "How do I get a customs code?",
      "responses": [
        "A customs code through Meydan+ is AED 525 — same price for new, renewal, or cancellation. You'll need this if your business involves importing or exporting goods. The team handles the registration process for you.",
        "Customs code costs AED 525 whether it's new registration, renewal, or cancellation. It's essential for any import/export activities. Meydan+ takes care of the whole process with Dubai Customs.",
        "Meydan+ handles customs code registration at AED 525. Same price for new, renewal, and cancellation. If you're in the trading business and need to import or export, this is one of the first things you'll want to set up."
      ],
      "keywords": [
        "customs code",
        "customs code cost",
        "import export code",
        "customs registration",
        "525 customs",
        "customs code meydan",
        "trade code",
        "import code",
        "export code",
        "customs clearance"
      ],
      "source": "price-list.pdf",
      "sourceTitle": "Meydan FZ Price List"
    },
    {
      "name": "Company Formation Process",
      "question": "How do I start a company with Meydan Free Zone?",
      "responses": [
        "Starting a company is pretty straightforward. Company formation itself is free — AED 0. You'll get it packaged with your license at AED 12,125 which covers formation, license, visa allocation, and flexi desk. The process starts with name reservation at AED 500 (valid 30 days), then you submit your documents for pre-approval at AED 500, and once approved, you get your license issued. The whole thing can be done remotely.",
        "It's simple! First, reserve your company name for AED 500 (holds for 30 days). Then apply for pre-approval at AED 500. Once approved, the license package is AED 12,125 which includes formation, license, visa allocation, and flexi desk. Formation itself doesn't cost extra — it's included. You don't even need to be physically present to set everything up.",
        "Great question! Here's how it works: Reserve your trade name (AED 500 for 30 days), get pre-approval (AED 500), then your license package is AED 12,125 all-in — that's formation, license, visa allocation, and flexi desk bundled together. Formation is free when packaged with the license. If you want urgent company setup, there's an express service for AED 1,050. The whole process can be done online."
      ],
      "keywords": [
        "start company",
        "company formation",
        "open business meydan",
        "register company",
        "setup company",
        "how to start",
        "new company",
        "business setup",
        "company registration",
        "form a company",
        "create company",
        "incorporate",
        "start a business"
      ],
      "source": "price-list.pdf",
      "sourceTitle": "Meydan FZ Price List"
    },
    {
      "name": "Name Reservation",
      "question": "How do I reserve a company name?",
      "responses": [
        "Name reservation is AED 500 and it holds your chosen name for 30 days. Renewal is also AED 500 for another 30 days if you need more time. Make sure to check name availability first — the team can help with that.",
        "It costs AED 500 to reserve a company name, valid for 30 days. If you need to extend, you can renew for another AED 500. This ensures nobody else takes your preferred business name while you're preparing your documents.",
        "Company name reservation is AED 500 for a 30-day hold. If you need more time to finalize your setup, you can renew it for another AED 500. I'd recommend having 2-3 name options ready in case your first choice is already taken."
      ],
      "keywords": [
        "name reservation",
        "reserve company name",
        "trade name",
        "business name",
        "name reservation cost",
        "500 name",
        "company name",
        "reserve name",
        "name booking"
      ],
      "source": "price-list.pdf",
      "sourceTitle": "Meydan FZ Price List"
    },
    {
      "name": "License Cancellation",
      "question": "How much does it cost to cancel a license?",
      "responses": [
        "License cancellation is AED 2,000. This is a one-time fee covering both the license and formation cancellation. Before cancelling, you'll need to make sure all visas are cancelled and any outstanding obligations are settled.",
        "Cancellation is AED 2,000 for both the license and formation together. Keep in mind you'll need to cancel all active visas first and clear any compliance requirements. If your license expired and you're past the 30-day grace period, there's also a AED 500 late fee.",
        "It's AED 2,000 to cancel your license and formation. Just a heads up — you'll need to cancel all employee and partner visas, settle any dues, and handle compliance filings before the license can be fully cancelled."
      ],
      "keywords": [
        "cancel license",
        "license cancellation cost",
        "close company",
        "cancel company",
        "license cancellation fee",
        "2000 cancellation",
        "close business",
        "wind up company",
        "terminate license",
        "shut down company"
      ],
      "source": "price-list.pdf",
      "sourceTitle": "Meydan FZ Price List"
    },
    {
      "name": "Late Fees and Penalties",
      "question": "What are the late fees for renewals?",
      "responses": [
        "For license renewal, there's a 30-day grace period after expiry. After that, it's a one-time AED 500 late fee. For the establishment/immigration card, it's AED 250 per month after expiry with no grace period. So definitely try to renew on time to avoid these charges.",
        "Late fees are: AED 500 one-time for license renewal (kicks in after a 30-day grace period post-expiry), and AED 250 per month for establishment card renewal (applies immediately after expiry). Set yourself a reminder a month before each expiry date.",
        "License late renewal fee is AED 500, but you get a 30-day grace period first. Establishment card late fee is AED 250 per month starting right from expiry. My recommendation: renew at least 2 weeks before expiry to avoid any stress."
      ],
      "keywords": [
        "late fee",
        "late renewal penalty",
        "renewal penalty",
        "overdue fee",
        "late fees meydan",
        "grace period",
        "500 late fee",
        "250 per month",
        "penalty charges",
        "expired license fee"
      ],
      "source": "price-list.pdf",
      "sourceTitle": "Meydan FZ Price List"
    },
    {
      "name": "Share Pledge Service",
      "question": "What is the share pledge service?",
      "responses": [
        "Share pledge is AED 1,000 whether it's new, amendment, or cancellation. It's used when you need to pledge your shares in the company as collateral, usually for bank financing or investment purposes.",
        "A share pledge — new, amend, or cancel — costs AED 1,000 each. This service is typically needed when a shareholder wants to use their company shares as collateral for a loan or as part of an investment agreement.",
        "Share pledge service is AED 1,000 for any action — new pledge, amendment, or cancellation. Companies usually use this when securing bank loans or investment deals where shares serve as security."
      ],
      "keywords": [
        "share pledge",
        "share pledge cost",
        "pledge shares",
        "share collateral",
        "1000 share pledge",
        "share pledge fee",
        "shares as collateral",
        "pledge cost"
      ],
      "source": "price-list.pdf",
      "sourceTitle": "Meydan FZ Price List"
    },
    {
      "name": "mElite Service",
      "question": "What is mElite?",
      "responses": [
        "mElite is Meydan's premium concierge service at AED 3,000 per year for up to 3 stakeholders. Each additional stakeholder is AED 1,000/year. A stakeholder here means any unique investor, partner, director, manager, or employee. It's designed to give you a VIP experience with priority handling.",
        "mElite is your VIP pass at Meydan Free Zone — AED 3,000 per year covering up to 3 stakeholders, with AED 1,000/year for each additional one. Stakeholders include investors, partners, directors, managers, and employees. Think of it as priority service for your most important people.",
        "It's Meydan's premium membership at AED 3,000/year for up to 3 stakeholders. Extra stakeholders are AED 1,000 each per year. A stakeholder is any unique person — investor, partner, director, manager, or employee. Gives you priority handling and VIP treatment across all Meydan services."
      ],
      "keywords": [
        "mElite",
        "mElite service",
        "mElite cost",
        "premium service",
        "VIP service",
        "mElite meydan",
        "3000 mElite",
        "priority service",
        "concierge service",
        "mElite membership"
      ],
      "source": "price-list.pdf",
      "sourceTitle": "Meydan FZ Price List"
    },
    {
      "name": "Bank Account Assistance",
      "question": "Can Meydan help me open a bank account?",
      "responses": [
        "Yes! Bank account assistance through Meydan+ is AED 1,500. They help facilitate the process with partner banks, prepare the required documentation, and guide you through the application. It significantly improves your chances of getting approved quickly.",
        "Absolutely. Meydan+ offers bank account assistance for AED 1,500. They work with several partner banks and help prepare all your documents to make the process smooth. Having a free zone company sometimes makes it tricky to open bank accounts, so having this assistance is really helpful.",
        "Meydan+ provides bank account opening assistance at AED 1,500. They coordinate with partner banks, prepare your documentation, and guide the whole process. Highly recommended — it makes what can be a frustrating process much smoother."
      ],
      "keywords": [
        "bank account",
        "open bank account",
        "bank account help",
        "bank account assistance",
        "1500 bank",
        "corporate bank account",
        "business bank account",
        "bank opening",
        "bank account meydan"
      ],
      "source": "price-list.pdf",
      "sourceTitle": "Meydan FZ Price List"
    },
    {
      "name": "PRO Services",
      "question": "What PRO services does Meydan offer?",
      "responses": [
        "Meydan+ offers PRO Services Package A at AED 3,000, which gives you 11 hours of support for government-related tasks. They handle things like NOCs from various authorities, customs code registration, employee list processing, MOFA attestation, Dubai Chamber registration, and more. It covers all the government-facing admin work you'd rather not deal with yourself.",
        "The PRO Services Package A is AED 3,000 for 11 hours of support. This covers all government liaison work — NOC applications from authorities like SIRA, RERA, DCAA, TDRA, customs codes, Dubai Chamber registration and document attestation, MOFA attestation, employee lists, and more. Basically everything that requires going to a government office.",
        "PRO services through Meydan+ start at AED 3,000 for Package A which includes 11 hours of government-related support. They handle all the running around — NOCs from 15+ government authorities, customs registration, Dubai Chamber work, MOFA attestation, you name it. Individual services are also available à la carte if you don't need the full package."
      ],
      "keywords": [
        "PRO services",
        "PRO service cost",
        "government services",
        "PRO package",
        "3000 PRO",
        "government liaison",
        "PRO meydan",
        "government tasks",
        "admin services",
        "PRO support"
      ],
      "source": "price-list.pdf",
      "sourceTitle": "Meydan FZ Price List"
    },
    {
      "name": "NOC from Government Authorities",
      "question": "How much do NOCs from government authorities cost?",
      "responses": [
        "NOC costs depend on the authority. Most are AED 825 — that covers RERA, DMCA, Culture Ministry, Dubai Sport Council, TDRA, MOCCA, KHDA, Dubai Police, and Dubai Municipality. DCAA and SIRA NOCs are AED 1,100. Department of Petroleum (DOPA) is AED 550. RTA NOC is also AED 1,100. Dubai Chamber registration is AED 825.",
        "Here's the breakdown: AED 825 for NOCs from RERA, DMCA, Ministry of Culture & Youth, Dubai Sport Council, TDRA, MOCCA, KHDA, Dubai Police, Dubai Municipality, and Dubai Chamber. Higher at AED 1,100 for DCAA (aviation) and SIRA (security). DOPA is lower at AED 550. RTA is AED 1,100.",
        "Most government authority NOCs through Meydan+ are AED 825 — this covers authorities like RERA, DMCA, KHDA, TDRA, Dubai Police, and several others. Aviation (DCAA) and security (SIRA) NOCs are AED 1,100. Petroleum (DOPA) is AED 550. All of these are NOCs required before your final license can be issued for certain activities."
      ],
      "keywords": [
        "NOC cost",
        "government NOC",
        "authority NOC",
        "NOC price",
        "RERA NOC",
        "SIRA NOC",
        "DCAA NOC",
        "DMCA NOC",
        "KHDA NOC",
        "government authority approval",
        "825 NOC",
        "1100 NOC"
      ],
      "source": "price-list.pdf",
      "sourceTitle": "Meydan FZ Price List"
    },
    {
      "name": "Meydan Commerce E-Commerce Services",
      "question": "What e-commerce services does Meydan offer?",
      "responses": [
        "Meydan has a full e-commerce suite through Meydan+. The Commerce Starter package is AED 350, with additional product listings at AED 100 per SKU per marketplace. The on-boarding package is AED 6,000 plus AED 2,000 per additional marketplace. For full seller account management, it's AED 24,000 plus AED 12,000 per additional marketplace. There's also an E-Commerce Starter service for getting set up.",
        "Here's the e-commerce lineup: Meydan Commerce Starter at AED 350 gets you started, with AED 100 per additional SKU per marketplace. For full on-boarding support, it's AED 6,000 (plus AED 2,000 per marketplace). If you want them to manage your seller accounts, that's AED 24,000 per year (plus AED 12,000 per marketplace). They basically handle everything from listing to selling.",
        "Meydan+ offers e-commerce services at multiple levels. Starter package is AED 350 to get you set up. On-boarding package at AED 6,000 helps you get onto marketplaces (AED 2,000 per additional marketplace). Full seller account management is AED 24,000 annually with AED 12,000 per additional marketplace. Great for businesses wanting to sell on Amazon, Noon, etc."
      ],
      "keywords": [
        "e-commerce",
        "meydan commerce",
        "online selling",
        "marketplace",
        "e-commerce cost",
        "commerce starter",
        "seller account",
        "online business",
        "amazon seller",
        "marketplace management",
        "ecommerce meydan"
      ],
      "source": "price-list.pdf",
      "sourceTitle": "Meydan FZ Price List"
    },
    {
      "name": "Digital Business Card Service",
      "question": "What is the digital business card service?",
      "responses": [
        "The digital business card is a free service included when you form your company. You get a QR code business card with your company logo, name, designation, and contact details. It also comes with a mini website at companyname.fz.mllc.ae, a company email address, and a phone extension where incoming calls are forwarded as voicemail to your email. All valid till end of calendar year.",
        "It's a complimentary service! When you register your company, you get a digital business card with a QR code that stores your contact details. Plus you get a free mini-website at companyname.fz.mllc.ae, a company email ID, and a phone number extension. Calls to the extension are forwarded as voicemail to your email. Pretty neat for AED 0.",
        "Digital business card is free — AED 0. It includes a QR-code based business card with your company logo and contact info, a simple website at companyname.fz.mllc.ae, a company email address (info@companyname.fz.mllc.ae), and a phone extension with voicemail forwarding. It's automatically generated when you register your company."
      ],
      "keywords": [
        "digital business card",
        "free business card",
        "QR code card",
        "business card meydan",
        "digital card",
        "company website",
        "free website",
        "mllc.ae",
        "digital business card service",
        "business card cost"
      ],
      "source": "meydan_services_defination_ppt.pdf",
      "sourceTitle": "Meydan Services Definition"
    },
    {
      "name": "Business Card Starter Package",
      "question": "What is the Business Card Starter package?",
      "responses": [
        "The Business Card Starter is AED 3,500. This is an upgrade from the free digital card — it gives you professional physical business cards along with enhanced digital presence. It's part of the mCore services suite.",
        "Business Card Starter costs AED 3,500. It's the premium version beyond the free digital business card, giving you a more professional business identity package for your company.",
        "It's AED 3,500 for the Business Card Starter package. This is for clients who want something more polished than the free digital card — better branding, professional design, and physical card options."
      ],
      "keywords": [
        "business card starter",
        "3500 business card",
        "business card package",
        "professional business card",
        "physical business card",
        "business card upgrade"
      ],
      "source": "price-list.pdf",
      "sourceTitle": "Meydan FZ Price List"
    },
    {
      "name": "Long Term Visit Visa",
      "question": "Can I get a long-term visit visa through Meydan?",
      "responses": [
        "Yes! Meydan+ offers long-term visit visa processing for AED 4,000. This is useful if you need to stay in the UAE for an extended period without a full residence visa.",
        "Meydan+ can arrange a long-term visit visa for AED 4,000. It's a good option if you need to be in the UAE for a longer duration while your company is being set up or for other business purposes.",
        "Long-term visit visa through Meydan+ is AED 4,000. Handy for situations where you need extended UAE stay — like during company setup, business meetings, or while waiting for your residence visa to process."
      ],
      "keywords": [
        "long term visit visa",
        "visit visa cost",
        "long visit",
        "4000 visit visa",
        "extended visit visa",
        "long stay visa",
        "visit visa meydan"
      ],
      "source": "price-list.pdf",
      "sourceTitle": "Meydan FZ Price List"
    },
    {
      "name": "Company Stamp",
      "question": "How do I get a company stamp?",
      "responses": [
        "A physical company stamp through Meydan+ is AED 200. Simple and quick — they'll make your official company stamp that you can use for signing documents, contracts, and official correspondence.",
        "Company stamp is AED 200 through Meydan+. It's your official rubber stamp with your company name and details. Useful for bank documents, contracts, and any official paperwork.",
        "Meydan+ provides company stamps for AED 200. It's a physical rubber stamp with your company details. While not always mandatory these days, many banks and government entities still ask for a stamped copy of documents."
      ],
      "keywords": [
        "company stamp",
        "stamp cost",
        "rubber stamp",
        "company stamp price",
        "official stamp",
        "200 stamp",
        "business stamp",
        "company seal"
      ],
      "source": "price-list.pdf",
      "sourceTitle": "Meydan FZ Price List"
    },
    {
      "name": "Document Translation",
      "question": "Does Meydan offer document translation?",
      "responses": [
        "Yes! Legal document translation through Meydan+ is AED 250 per page. This is certified legal translation, typically from English to Arabic or vice versa, which is required for many government submissions.",
        "Meydan+ offers legal document translation at AED 250 per page. It's certified translation, usually English-Arabic, needed for contracts, court documents, government submissions, and legal proceedings.",
        "Legal translation is available at AED 250 per page through Meydan+. It's certified and accepted by all UAE government authorities. Essential for Arabic translations of your corporate documents."
      ],
      "keywords": [
        "document translation",
        "legal translation",
        "translation cost",
        "translate documents",
        "250 per page",
        "Arabic translation",
        "certified translation",
        "translation service"
      ],
      "source": "price-list.pdf",
      "sourceTitle": "Meydan FZ Price List"
    },
    {
      "name": "Compliance Services",
      "question": "What compliance services are available?",
      "responses": [
        "Meydan+ offers several compliance services: Compliance Notification Filing at AED 1,300 for portal submissions, Compliance Assessment at AED 1,800 covering ESR, GO AML, and UBO requirements, and ESR Comprehensive Assessment at AED 5,250 for businesses needing a deep dive into financial transactions. These keep you compliant with UAE regulatory requirements.",
        "Here's what's available: Compliance Notification Filing — AED 1,300 (submission on authority portals). Compliance Assessment — AED 1,800 (covers ESR, GO AML, UBO). ESR Comprehensive Assessment — AED 5,250 (deep financial analysis). These are important because UAE has strict compliance requirements and penalties for non-compliance can be significant.",
        "Meydan+ handles all compliance: Notification Filing at AED 1,300 for authority portal submissions, general Compliance Assessment at AED 1,800 for ESR, GO AML, and UBO, and the ESR Comprehensive Assessment at AED 5,250 for detailed financial transaction analysis. Every free zone company needs to stay compliant, so these services are essential."
      ],
      "keywords": [
        "compliance services",
        "ESR filing",
        "compliance cost",
        "GO AML",
        "UBO reporting",
        "compliance assessment",
        "ESR assessment",
        "regulatory compliance",
        "compliance meydan",
        "1300 compliance",
        "1800 compliance"
      ],
      "source": "price-list.pdf",
      "sourceTitle": "Meydan FZ Price List"
    },
    {
      "name": "Visa Physical Stamping",
      "question": "Do I need to get my visa physically stamped?",
      "responses": [
        "No, visa stamping is not mandatory anymore per immigration rules. However, if you'd like a physical stamp on your passport, Meydan can arrange it for AED 1,000. It's completely optional.",
        "Physical visa stamping is optional now — immigration doesn't require it anymore. But if you want the stamp on your passport for peace of mind or any other reason, it's AED 1,000 through Meydan.",
        "Not required! As per current immigration rules, physical visa stamping is no longer mandatory. Your residence visa is digital and valid without a stamp. If you still want one, Meydan offers it as an optional service for AED 1,000."
      ],
      "keywords": [
        "visa stamping",
        "physical stamp",
        "passport stamp",
        "visa stamp cost",
        "1000 stamping",
        "residence visa stamp",
        "stamp passport",
        "visa stamping mandatory"
      ],
      "source": "price-list.pdf",
      "sourceTitle": "Meydan FZ Price List"
    },
    {
      "name": "Employee Contract Services",
      "question": "How much does an employment contract cost?",
      "responses": [
        "Employment contract services are: AED 350 for new, amendment, or renewal. Cancellation is AED 100, but only if you're on a contract or combined with residence visa cancellation. The employment contract is only needed separately if it's not bundled with the visa process.",
        "New employment contract is AED 350, same for amendments and renewals. Cancellation is just AED 100 (only applicable if on contract, otherwise AED 0 when done with residence visa cancellation). This is a separate service only needed when the employment contract isn't part of your standard visa package.",
        "Employment contracts through Meydan are AED 350 each for new, amendment, or renewal. Cancellation is AED 100. These are only applicable when the employment contract is handled separately from the visa process."
      ],
      "keywords": [
        "employment contract",
        "contract cost",
        "employee contract",
        "employment contract fee",
        "350 contract",
        "labor contract",
        "work contract",
        "contract meydan"
      ],
      "source": "price-list.pdf",
      "sourceTitle": "Meydan FZ Price List"
    },
    {
      "name": "Change of Status Cost",
      "question": "How much does a change of status cost?",
      "responses": [
        "Change of status is AED 1,500 for employees. This applies when someone is already in the UAE on a different visa type and needs to switch to an employment or partner visa status without leaving the country.",
        "It's AED 1,500 for a change of status. This is used when a person is currently in the UAE on a visit visa, tourist visa, or another type and needs to change to a residence visa status. Saves you the trip of leaving and re-entering the country.",
        "Status change costs AED 1,500. It's needed when converting from one visa type to another within the UAE — for example, switching from a visit visa to an employment visa. Much more convenient than doing an exit and re-entry."
      ],
      "keywords": [
        "change of status",
        "status change cost",
        "visa status change",
        "convert visa",
        "1500 status change",
        "change visa type",
        "status conversion",
        "visit to employment visa"
      ],
      "source": "price-list.pdf",
      "sourceTitle": "Meydan FZ Price List"
    },
    {
      "name": "Absconding Case",
      "question": "What if an employee absconds?",
      "responses": [
        "Filing a new absconding case costs AED 7,500. Cancelling an absconding case is AED 250. This is the legal process you'd need to follow if an employee leaves without proper notice or visa cancellation. It protects you as the employer from liability.",
        "Absconding case filing is AED 7,500 for new cases and AED 250 to cancel. It's an unfortunate situation but necessary to protect your company legally when an employee disappears without going through proper exit procedures.",
        "For absconding cases: filing is AED 7,500, cancellation is AED 250. It's the formal process to report an employee who has abandoned their position. Important to file this to avoid any immigration liability on your company."
      ],
      "keywords": [
        "absconding",
        "absconding case",
        "employee absconding",
        "absconding cost",
        "7500 absconding",
        "file absconding",
        "report absconding",
        "employee disappeared"
      ],
      "source": "price-list.pdf",
      "sourceTitle": "Meydan FZ Price List"
    },
    {
      "name": "Meydan Pay Service",
      "question": "What is Meydan Pay?",
      "responses": [
        "Meydan Pay is a free payment service — AED 0. It's available to all Meydan Free Zone companies and helps facilitate payments. For Channel Partner clients, it's also offered free of charge.",
        "Meydan Pay is a complimentary service — absolutely free. It's a payment facilitation tool for Meydan Free Zone companies. If you're a Channel Partner (CP) client, you also get it at no cost.",
        "It's free! Meydan Pay costs AED 0 and is available to all Meydan Free Zone companies. Channel Partner clients also get it for free. It's designed to make your payment processes smoother."
      ],
      "keywords": [
        "meydan pay",
        "payment service",
        "meydan pay cost",
        "free payment",
        "payment system",
        "meydan pay service"
      ],
      "source": "price-list.pdf",
      "sourceTitle": "Meydan FZ Price List"
    },
    {
      "name": "Refund Processing Fee",
      "question": "Is there a refund processing fee?",
      "responses": [
        "Yes, there's a AED 2,000 admin fee when processing refunds for rejected Establishment Card or Partner Visa applications. This is the processing charge for handling the refund back to you.",
        "Refund processing fee is AED 2,000. This applies when you need a refund for a rejected establishment card or partner visa application. It covers the administrative costs of processing the refund.",
        "There's a AED 2,000 refund processing fee, which kicks in when an establishment card or partner visa application gets rejected and you need your money back. It's an admin charge for processing the refund."
      ],
      "keywords": [
        "refund fee",
        "refund processing",
        "2000 refund",
        "rejection refund",
        "get refund",
        "money back",
        "refund charges"
      ],
      "source": "price-list.pdf",
      "sourceTitle": "Meydan FZ Price List"
    },
    {
      "name": "Return Permit for Residents Abroad",
      "question": "What if I've been outside the UAE for more than 6 months?",
      "responses": [
        "If you've been outside the UAE for more than 6 months, you'll need a Return Permit to re-enter. Meydan+ handles this for AED 850. Without it, your residence visa might be at risk of cancellation due to extended absence.",
        "Meydan+ offers a Return Permit for AED 850 for residents who've been outside the UAE for more than 6 months. This is important because your residence visa can be affected if you stay away too long. The permit ensures you can re-enter without issues.",
        "You'll need a Return Permit — AED 850 through Meydan+. Being outside the UAE for over 6 months can jeopardize your residence visa status. This permit ensures you can return and your visa stays active."
      ],
      "keywords": [
        "return permit",
        "outside UAE 6 months",
        "re-entry permit",
        "850 return permit",
        "long absence UAE",
        "return permit cost",
        "residence visa abroad"
      ],
      "source": "price-list.pdf",
      "sourceTitle": "Meydan FZ Price List"
    },
    {
      "name": "Mail Management Service",
      "question": "What is the mail management service?",
      "responses": [
        "Mail management through Meydan+ is AED 750 per year for both new and renewal. Cancellation is free. The team receives, sorts, and manages your physical mail on your behalf. Great if you don't have a physical office presence.",
        "Meydan+ mail management costs AED 750/year. They handle receiving and organizing all your company mail. New setup and renewal are the same price, and cancellation is AED 0. It pairs well with the PO Box service.",
        "It's AED 750 per year. Meydan+ receives and manages your postal mail for you. Super useful if you're running your business remotely or don't have a physical office. Cancellation is free whenever you want."
      ],
      "keywords": [
        "mail management",
        "mail service",
        "mail handling",
        "750 mail",
        "postal management",
        "receive mail",
        "mail management cost",
        "business mail"
      ],
      "source": "price-list.pdf",
      "sourceTitle": "Meydan FZ Price List"
    },
    {
      "name": "Document Pick Up and Drop Off",
      "question": "Can Meydan pick up or deliver documents for me?",
      "responses": [
        "Yes! Meydan+ offers document pick-up and drop-off services within Dubai. Pick-up is AED 250, drop-off is AED 250, or you can get both together for AED 500. Very handy when you can't make it to the office.",
        "Absolutely. Document pick-up is AED 250 and drop-off is AED 250 — both within Dubai. If you need a combined pick-up and drop-off, it's AED 500. Saves you the trip when you need to submit or collect documents.",
        "Meydan+ does document pick-up for AED 250 and drop-off for AED 250, all within Dubai. Combined service is AED 500. Really useful if you're busy or not near the Meydan office."
      ],
      "keywords": [
        "document pick up",
        "document delivery",
        "pick up drop off",
        "collect documents",
        "deliver documents",
        "250 pick up",
        "500 pick up drop off",
        "document courier"
      ],
      "source": "price-list.pdf",
      "sourceTitle": "Meydan FZ Price List"
    },
    {
      "name": "Overstay Fine Settlement",
      "question": "What about overstay fines?",
      "responses": [
        "Overstay fine settlement fee through Meydan is AED 250 — that's their processing fee to handle the settlement. The actual overstay fine amount depends on how long the overstay period is, as per UAE immigration rules.",
        "The processing fee for overstay fine settlement is AED 250 through Meydan. This is separate from the actual government overstay fine, which varies based on the number of days overstayed.",
        "Meydan charges AED 250 as a settlement processing fee for overstay fines. The government fine itself is separate and depends on how many days the person overstayed. Best to resolve it quickly as fines accumulate daily."
      ],
      "keywords": [
        "overstay fine",
        "overstay penalty",
        "overstay settlement",
        "visa overstay",
        "overstay cost",
        "250 overstay",
        "overstay fee",
        "fine settlement"
      ],
      "source": "price-list.pdf",
      "sourceTitle": "Meydan FZ Price List"
    },
    {
      "name": "Total Startup Cost Estimate",
      "question": "What's the total cost to set up a company in Meydan Free Zone?",
      "responses": [
        "For a basic setup, here's what you're looking at: License package AED 12,125 (includes formation, license, visa allocation, flexi desk). Then you'll need your visa — employment visa AED 3,500 or investor visa AED 4,000. Add medical and Emirates ID at AED 2,250. So roughly AED 17,875 to AED 18,375 to be fully set up and operational. Name reservation and pre-approval add AED 1,000 upfront.",
        "Ballpark for a basic setup: License package is AED 12,125 all-in. Visa is AED 3,500 (employee) or AED 4,000 (investor/partner). Medical + EID is AED 2,250. So you're looking at about AED 18,000-19,000 total to get your company running with one person. Optional add-ons like PO Box, phone answering, and medical insurance are extra.",
        "A typical startup costs roughly AED 18,000-19,000. That breaks down to: AED 12,125 for the license package (formation + license + visa allocation + flexi desk), AED 3,500-4,000 for your visa, and AED 2,250 for medical and EID. Plus AED 500 for name reservation and AED 500 for pre-approval. Everything else — office upgrades, PO Box, phone answering — is optional depending on your needs."
      ],
      "keywords": [
        "total cost",
        "startup cost",
        "how much to start",
        "total setup cost",
        "company setup cost",
        "overall cost",
        "budget needed",
        "how much money needed",
        "total investment",
        "cost breakdown",
        "what will it cost me"
      ],
      "source": "price-list.pdf",
      "sourceTitle": "Meydan FZ Price List"
    },
    {
      "name": "Urgent Services",
      "question": "Are there urgent or express processing options?",
      "responses": [
        "Yes! Urgent company setup is AED 1,050 for expedited processing. Urgent employee service (for visa new/renew/cancel) is AED 1,000 extra. Urgent Emirates ID with biometrics appointment is AED 1,250, or AED 2,750 combined with medical assistance. These get your requests prioritized and processed faster.",
        "Meydan offers several express options: Urgent company setup at AED 1,050, urgent visa processing at AED 1,000 extra (covers new, renewal, or cancellation), and urgent Emirates ID at AED 1,250 (with biometrics appointment included). If you need medical + urgent EID, that's AED 2,750. Worth it when time is critical.",
        "Express processing is available for most services. Company setup can be expedited for AED 1,050. Visa processing urgency is an extra AED 1,000. Urgent EID processing with biometrics is AED 1,250 or AED 2,750 with medical. If you're in a rush, these services are lifesavers."
      ],
      "keywords": [
        "urgent service",
        "express processing",
        "fast track",
        "expedited",
        "urgent setup",
        "1050 urgent",
        "quick processing",
        "rush service",
        "urgent visa",
        "priority processing"
      ],
      "source": "price-list.pdf",
      "sourceTitle": "Meydan FZ Price List"
    },
    {
      "name": "All Prices VAT Inclusive",
      "question": "Are the prices inclusive of VAT?",
      "responses": [
        "Yes, all prices quoted by Meydan Free Zone are in AED and inclusive of VAT where applicable. What you see is what you pay — no hidden taxes on top.",
        "All prices are quoted in AED and include VAT where applicable. So the amounts I've shared are the final amounts — no additional tax surprises.",
        "Everything is VAT inclusive where applicable. All pricing is in AED. The price you're quoted is the price you pay. Straightforward, no hidden charges."
      ],
      "keywords": [
        "VAT inclusive",
        "tax included",
        "prices include VAT",
        "additional tax",
        "hidden charges",
        "final price",
        "VAT on top"
      ],
      "source": "price-list.pdf",
      "sourceTitle": "Meydan FZ Price List"
    },
    {
      "name": "Innovation and Knowledge Fees",
      "question": "What are the Innovation and Knowledge fees?",
      "responses": [
        "Innovation Fee and Knowledge Fee are each AED 10, charged once per invoice. They're standard government-mandated fees that appear on your invoices. Very small amounts — just AED 20 total per invoice.",
        "These are small government fees — AED 10 each (Innovation Fee + Knowledge Fee = AED 20 total), charged once per invoice. They're standard across Dubai free zones.",
        "They're AED 10 each per invoice — Innovation Fee and Knowledge Fee. So AED 20 combined. Standard government-mandated charges that show up on every invoice. Nothing major."
      ],
      "keywords": [
        "innovation fee",
        "knowledge fee",
        "10 AED fee",
        "government fee invoice",
        "innovation knowledge fee",
        "small fees",
        "invoice fees"
      ],
      "source": "price-list.pdf",
      "sourceTitle": "Meydan FZ Price List"
    },
    {
      "name": "NOC to Lease Outside Free Zone",
      "question": "Can I lease an office outside the free zone?",
      "responses": [
        "Yes! You'll need a NOC (No Objection Certificate) to lease a facility outside the Meydan Free Zone, which costs AED 2,500. This allows your free zone company to rent office or warehouse space on the mainland or in other areas.",
        "You can! Meydan issues a NOC for leasing facilities outside the free zone at AED 2,500. This is needed if you want to rent a warehouse, shop, or office elsewhere in Dubai while keeping your Meydan Free Zone license.",
        "Absolutely. The NOC to Lease Facility Outside the Free Zone is AED 2,500. Many companies use this to get additional workspace or storage on the mainland while maintaining their free zone company structure."
      ],
      "keywords": [
        "lease outside free zone",
        "NOC lease",
        "office outside",
        "2500 NOC",
        "lease mainland",
        "rent outside",
        "external office",
        "warehouse lease",
        "lease NOC"
      ],
      "source": "price-list.pdf",
      "sourceTitle": "Meydan FZ Price List"
    },
    {
      "name": "Corporate Letters and Resolutions",
      "question": "How much do corporate letters and resolutions cost?",
      "responses": [
        "Corporate letter is AED 250, employee letter is also AED 250, and a resolution is AED 350. Certified true copy is AED 350. These are standard administrative documents you might need for banks, embassies, or other official purposes.",
        "Corporate letters are AED 250 each, employee letters AED 250, board resolutions AED 350, and certified true copies AED 350. Pretty standard pricing for the admin paperwork that comes with running a business.",
        "Here's the admin document pricing: Corporate letter — AED 250, employee letter — AED 250, resolution — AED 350, certified true copy — AED 350. You'll typically need these for bank account openings, visa applications, or legal matters."
      ],
      "keywords": [
        "corporate letter",
        "resolution cost",
        "letter cost",
        "certified copy",
        "250 letter",
        "350 resolution",
        "company letter",
        "board resolution",
        "employee letter",
        "salary certificate"
      ],
      "source": "price-list.pdf",
      "sourceTitle": "Meydan FZ Price List"
    },
    {
      "name": "Business Card Premium Package",
      "category": "mcore",
      "question": "What's included in Business Card Premium?",
      "responses": [
        "Business Card Premium includes everything in the Starter package plus a phone answering service. You get a custom logo with one revision, up to 5 email addresses for a year, a shared PO Box, social media accounts on LinkedIn, Instagram, and X, plus a UAE landline with personalized phone answering by a multilingual agent during business hours. Voicemails are forwarded to your email instantly.",
        "The Premium package upgrades your Business Card Starter with a full phone answering service — a dedicated UAE landline number, multilingual agent answering during business hours, voicemail with instant email notifications. Plus you still get the custom logo, 5 email addresses, domain assistance, shared PO Box, and social media setup.",
        "Think of Business Card Premium as Starter on steroids. Same custom logo, domain assistance, email addresses, PO Box, and social media setup — but with a professional phone answering service added. A multilingual agent handles your calls during business hours, forwards messages, and you get instant email notifications for everything."
      ],
      "keywords": [
        "business card premium",
        "premium business card",
        "phone answering card",
        "business card upgrade",
        "premium package",
        "business card with phone",
        "premium vs starter",
        "business card comparison"
      ],
      "source": "meydan_services_defination_ppt.pdf",
      "sourceTitle": "Meydan Services Definition"
    },
    {
      "name": "Corporate Tax CT 300 Package",
      "category": "maccounting",
      "question": "What is the CT 300 package?",
      "responses": [
        "CT 300 is the comprehensive corporate tax package at AED 10,800 per year. It includes 1,200 minutes of advisory calls, bookkeeping for up to 3,600 transactions annually, management accounts, CT return filing, VAT registration and quarterly filings if applicable, monthly financial statements, FTA profile amendments, annual financial review, payroll processing for up to 50 employees, document archiving, and a dedicated account manager. It's the all-in-one solution for businesses with moderate activity.",
        "The CT 300 package costs AED 10,800/year and is designed for businesses with small to moderate transaction volumes. You get a dedicated account manager, bookkeeping up to 3,600 transactions/year, monthly financial statements, corporate tax return filing, VAT registration and quarterly filings, payroll for 50 employees, 1,200 minutes of advisory calls, and document archiving. Basically everything tax and accounting in one package.",
        "For AED 10,800 per year, CT 300 gives you the full accounting and tax suite: dedicated account manager, 3,600 annual transactions in bookkeeping, corporate tax returns, VAT registration and quarterly filings, monthly financial statements, payroll for up to 50 staff, 1,200 minutes of advisory calls, FTA profile management, annual financial review, and document archiving. Service activates within 1 day."
      ],
      "keywords": [
        "ct 300",
        "corporate tax 300",
        "ct 300 package",
        "10800 tax",
        "comprehensive tax package",
        "full accounting package",
        "ct 300 cost",
        "tax and accounting bundle",
        "dedicated account manager",
        "annual tax package"
      ],
      "source": "meydan_services_defination_ppt.pdf",
      "sourceTitle": "Meydan Services Definition"
    },
    {
      "name": "Corporate Tax Deregistration",
      "category": "maccounting",
      "question": "How do I deregister from corporate tax?",
      "responses": [
        "Corporate tax deregistration costs AED 2,100 and includes your final CT return filing plus the actual deregistration with FTA. Very important — if you don't deregister within 3 months of liquidation or license cancellation, you'll face a fine of AED 10,000 charged to the partner or shareholder. So don't delay this one.",
        "The CT deregistration service is AED 2,100. It covers filing your final corporate tax return and completing the deregistration with the Federal Tax Authority. Heads up: there's a strict 3-month deadline after liquidation or license cancellation. Miss it and FTA will hit you with an AED 10,000 penalty against the partner/shareholder personally.",
        "Deregistering from corporate tax costs AED 2,100 and covers your final CT return and FTA deregistration. Critical warning: you must complete this within 3 months of company liquidation or license cancellation. Failing to do so results in a hefty AED 10,000 fine to the partner or shareholder. We handle the filing and deregistration process for you."
      ],
      "keywords": [
        "ct deregistration",
        "corporate tax deregistration",
        "cancel corporate tax",
        "deregister tax",
        "fta deregistration",
        "tax cancellation",
        "2100 deregistration",
        "close tax account",
        "tax penalty 10000",
        "deregister fta"
      ],
      "source": "meydan_services_defination_ppt.pdf",
      "sourceTitle": "Meydan Services Definition"
    },
    {
      "name": "Liquidation Services Overview",
      "category": "maccounting",
      "question": "How much does company liquidation cost?",
      "responses": [
        "Liquidation pricing depends on your company size. Liquidation Report alone is AED 1,000 — that's a prerequisite for license cancellation. Liquidation Starter is AED 9,000 for companies with 0-50 employees (14 days for 0 employees, 5-9 weeks for 1-50). For companies with 50+ employees, Liquidation 50 is AED 12,600 and takes 9-16 weeks. All packages include shareholders resolution, appointed liquidator, liquidation certificate, Arabic and English advertisement, clearance from FTA, Dubai Customs, Dubai Investment, Emirates Post, DEWA, and RTA, plus assistance with bank account closure.",
        "We have three liquidation tiers. The basic Liquidation Report is AED 1,000 — just the report needed before license cancellation. Liquidation Starter at AED 9,000 covers the full process for companies up to 50 employees: shareholders resolution, liquidator appointment, clearances from all relevant authorities (FTA, Customs, Dubai Investment, Emirates Post, DEWA, RTA), advertisement in English and Arabic, bank closure assistance, and the final cancellation certificates. For 50+ employees, it's AED 12,600 with a 9-16 week timeline.",
        "Company liquidation runs from AED 1,000 to AED 12,600 depending on complexity. A simple Liquidation Report is AED 1,000. The full Liquidation Starter at AED 9,000 handles everything — shareholders resolution, appointed liquidator, government clearances (FTA VAT/CT, Dubai Customs, Dubai Investment, Emirates Post, DEWA, RTA), newspaper advertisement in both languages, bank account closure support, and final cancellation certificates. Processing is 14 days for zero-employee companies, 5-9 weeks for up to 50. Above 50 employees, the Liquidation 50 package is AED 12,600 taking 9-16 weeks. Note: establishment card and active visas must be cancelled first."
      ],
      "keywords": [
        "liquidation",
        "company liquidation",
        "liquidation cost",
        "close company",
        "wind up company",
        "liquidation starter",
        "liquidation 50",
        "liquidation report",
        "company closure",
        "9000 liquidation",
        "12600 liquidation",
        "dissolve company"
      ],
      "source": "meydan_services_defination_ppt.pdf",
      "sourceTitle": "Meydan Services Definition"
    },
    {
      "name": "Financial Audit Report",
      "category": "maccounting",
      "question": "How much does a financial audit cost?",
      "responses": [
        "A financial audit report costs AED 3,000 and takes about 14 business days. You'll receive audited financial statements plus the audit report signed and stamped by a certified accountant from the Ministry of Economics. This is a prerequisite for company renewal, so make sure to plan ahead.",
        "The financial audit service is AED 3,000 with a 14-day turnaround. A certified accountant from the Ministry of Economics examines your company's financials for the fiscal year and provides signed, stamped audited statements and an audit report. Important: this is required for your company renewal.",
        "Financial audit is AED 3,000, processed within 14 business days. It covers a thorough examination of your company's financial reports by a Ministry of Economics certified accountant. You get audited financial statements and a signed and stamped audit report. Keep in mind this is a prerequisite for license renewal, so factor it into your renewal timeline."
      ],
      "keywords": [
        "financial audit",
        "audit report",
        "audit cost",
        "3000 audit",
        "audited statements",
        "company audit",
        "annual audit",
        "audit for renewal",
        "financial statements audit",
        "moe audit"
      ],
      "source": "meydan_services_defination_ppt.pdf",
      "sourceTitle": "Meydan Services Definition"
    },
    {
      "name": "Financial Advisory Service",
      "category": "maccounting",
      "question": "What is the Financial Advisory service?",
      "responses": [
        "Financial Advisory is a premium service at AED 36,000 that gives you monthly 90-minute video calls with a financial expert. Topics covered include financial forecasting, budgeting, cash flow management, financial risk management, working capital advisory, start-up advisory, and cost optimization. You get personalized recommendations and specific next steps after each session. Processing starts within 7 business days.",
        "For AED 36,000, the Financial Advisory service provides ongoing monthly consultations via 90-minute video calls. Your advisor covers everything from budgeting and forecasting to cash flow management, risk assessment, working capital, startup guidance, and cost optimization. Each session ends with a financial review and specific action items tailored to your business. Takes 7 business days to set up.",
        "The Financial Advisory package costs AED 36,000 and includes monthly 90-minute video consultations with a dedicated financial advisor. They cover a wide range of topics — financial forecasting, budgeting, cash flow management, risk management, working capital optimization, startup guidance, and cost reduction strategies. After each call, you receive a review of your financial statements and personalized recommendations with clear next steps."
      ],
      "keywords": [
        "financial advisory",
        "financial advisor",
        "advisory service",
        "36000 advisory",
        "monthly financial advice",
        "financial consulting",
        "cash flow advisory",
        "budgeting advice",
        "financial expert",
        "financial guidance"
      ],
      "source": "meydan_services_defination_ppt.pdf",
      "sourceTitle": "Meydan Services Definition"
    },
    {
      "name": "Forecasting and Budgeting Report",
      "category": "maccounting",
      "question": "What is the Forecasting and Budgeting Report?",
      "responses": [
        "The Forecasting and Budgeting Report costs AED 6,000 and takes 7-10 business days. It provides projections of your future revenues and expenses for up to 3 years. You receive an Excel workbook with detailed analysis and workings covering financial challenges and opportunities. We'll need your historical financial statements (last 3-5 years) and any market research data you have.",
        "For AED 6,000, you get a comprehensive financial forecast covering up to 3 years of projected revenues and expenses. The deliverable is a detailed Excel workbook analyzing your financial challenges and opportunities. Processing takes 7-10 business days. You'll need to provide historical financial statements from the last 3-5 years and any market research data if available.",
        "A Forecasting and Budgeting Report is AED 6,000 with a 7-10 day turnaround. It gives your business a clear picture of past, current, and projected financial conditions — projecting revenue and expenses up to 3 years out. You receive a detailed Excel workbook with all the analysis. We just need your last 3-5 years of financial statements and any relevant market research data to get started."
      ],
      "keywords": [
        "forecasting report",
        "budgeting report",
        "financial forecast",
        "3 year projection",
        "revenue projection",
        "6000 forecast",
        "financial planning",
        "budget planning",
        "expense projection",
        "business forecast"
      ],
      "source": "meydan_services_defination_ppt.pdf",
      "sourceTitle": "Meydan Services Definition"
    },
    {
      "name": "Business Valuation Report",
      "category": "maccounting",
      "question": "How much does a business valuation cost?",
      "responses": [
        "A Business Valuation Report costs AED 10,000. It provides an in-depth analysis of your business's worth, covering current and future revenue streams, associated costs, and KPIs. Includes a high-level review of your historical financial statements and preparation of the valuation report with one revision. You'll need to provide your financial statements (audited or non-audited), manager details, and an overview of your business model and projections.",
        "The Valuation Report service is AED 10,000 and gives you a comprehensive analysis of what your business is worth. It identifies revenue streams, costs, and key performance indicators, reviews your historical financials, and produces a detailed valuation report (with one revision included). Ideal for investment rounds, partnerships, or strategic planning. We'll need your financial statements, forecasts, and business model overview.",
        "For AED 10,000, our Business Valuation service delivers an in-depth report analyzing your company's worth. The analysis covers current and future revenue streams, cost structures, and KPIs, alongside a review of your historical financial statements. You receive a comprehensive valuation report with one revision included. Great for investors, potential acquisitions, or understanding your business's market value."
      ],
      "keywords": [
        "valuation report",
        "business valuation",
        "company valuation",
        "10000 valuation",
        "business worth",
        "company worth",
        "valuation cost",
        "business appraisal",
        "value assessment",
        "investment valuation"
      ],
      "source": "meydan_services_defination_ppt.pdf",
      "sourceTitle": "Meydan Services Definition"
    },
    {
      "name": "Medical Insurance Categories",
      "category": "mresidency",
      "question": "What are the medical insurance categories and pricing?",
      "responses": [
        "Medical insurance in Dubai is mandatory for all residents. There are 4 categories: Category A for employees earning above AED 4,000 — costs AED 1,680. Category B for employees earning below AED 4,000 — also AED 1,680. Category C for dependent children — AED 1,376. Category D for dependent spouses — AED 3,160. All categories are processed within 1 business day.",
        "Here's the medical insurance breakdown by category: Cat A (employee salary >4,000) — AED 1,680, Cat B (employee salary <4,000) — AED 1,680, Cat C (dependent children) — AED 1,376, Cat D (dependent spouse) — AED 3,160. Each one processes in just 1 day. Remember, medical insurance is mandatory for all UAE residents — investors, employees, dependents, and domestic workers.",
        "Medical insurance is mandatory for all Dubai residents and comes in 4 categories. Employees with salary above AED 4,000 (Cat A) or below AED 4,000 (Cat B) both cost AED 1,680. Dependent children (Cat C) are AED 1,376 and dependent spouses (Cat D) are AED 3,160. All policies are activated within 1 business day. We handle the application with the insurance provider and deliver your policy certificate."
      ],
      "keywords": [
        "medical insurance category",
        "insurance category a",
        "insurance category b",
        "insurance category c",
        "insurance category d",
        "1680 insurance",
        "1376 insurance",
        "3160 insurance",
        "employee insurance",
        "dependent insurance",
        "spouse insurance",
        "children insurance"
      ],
      "source": "meydan_services_defination_ppt.pdf",
      "sourceTitle": "Meydan Services Definition"
    },
    {
      "name": "Dependent Visa Cancellation",
      "category": "mresidency",
      "question": "How do I cancel a dependent visa?",
      "responses": [
        "Dependent visa cancellation costs AED 1,000 and takes about 2 business days. You'll need the dependent's Emirates ID (original or copy) or UAE Pass access. The cancellation terminates the current residence visa of the dependent. Pretty straightforward process.",
        "Cancelling a dependent residence visa is AED 1,000 with a 2-day processing time. Just bring the Emirates ID original or copy (or UAE Pass if the physical card isn't available). The process terminates the dependent's current residence visa in the UAE.",
        "To cancel a dependent's residence visa, the fee is AED 1,000 and it's processed within 2 days. Requirements are simple — Emirates ID original or copy, or UAE Pass if the card isn't available. Once processed, the dependent's residence visa is formally terminated."
      ],
      "keywords": [
        "cancel dependent visa",
        "dependent visa cancellation",
        "1000 cancel visa",
        "terminate dependent visa",
        "cancel spouse visa",
        "cancel child visa",
        "dependent visa cancel cost",
        "end dependent visa"
      ],
      "source": "meydan_services_defination_ppt.pdf",
      "sourceTitle": "Meydan Services Definition"
    },
    {
      "name": "EID Card Delivery Service",
      "category": "mresidency",
      "question": "Can I get my Emirates ID delivered?",
      "responses": [
        "Yes! Meydan Free Zone offers a free EID card delivery service to eliminate the need for you to visit the office for collection. This service is available for clients in Dubai and Sharjah. Delivery typically takes 1-2 working days after the card is ready.",
        "Meydan offers free Emirates ID card delivery — no need to come to the office to pick it up. The service covers Dubai and Sharjah residents and takes 1-2 working days. Just provide your delivery details and we'll get your EID card to your door.",
        "The EID Card Delivery service is free of charge and delivers your Emirates ID card directly to you, so you don't have to visit the Meydan Free Zone office. Currently available for clients in Dubai and Sharjah only, with a 1-2 working day delivery timeline."
      ],
      "keywords": [
        "eid delivery",
        "emirates id delivery",
        "deliver eid",
        "eid card delivery",
        "collect emirates id",
        "eid to door",
        "eid pickup",
        "emirates id collection"
      ],
      "source": "meydan_services_defination_ppt.pdf",
      "sourceTitle": "Meydan Services Definition"
    },
    {
      "name": "Exploration Visa",
      "category": "mresidency",
      "question": "What is the Exploration Visa and how much does it cost?",
      "responses": [
        "The Exploration Visa is a single-entry visa for people looking to explore job or business opportunities in the UAE. Pricing is tiered by duration: AED 3,500 for 1-60 days, AED 7,100 for 61-120 days, and AED 13,500 for 121-180 days. There's also a refundable deposit of AED 1,604 plus AED 10 each for knowledge and innovation fees. Processed within 2 business days. You'll need your passport, bank statement, and university degree.",
        "An Exploration Visa lets you enter the UAE to explore job or business opportunities. It comes in three tiers: 60 days for AED 3,500, 120 days for AED 7,100, or 180 days for AED 13,500. On top of the visa fee, there's a refundable security deposit of AED 1,604 and small knowledge/innovation fees of AED 10 each. Takes just 2 business days to process. Bring your passport, bank statement, and university degree.",
        "Looking to explore opportunities in the UAE? The Exploration Visa gives you a single-entry visa with flexible duration options. For 1-60 days it's AED 3,500, 61-120 days is AED 7,100, and 121-180 days runs AED 13,500. You'll also pay a refundable deposit of AED 1,604 and AED 20 in knowledge and innovation fees. Processing takes 2 business days. Documents needed: passport, bank statement, and university degree. Health insurance is also included."
      ],
      "keywords": [
        "exploration visa",
        "explore visa",
        "explore uae visa",
        "3500 visa",
        "7100 visa",
        "13500 visa",
        "short term visa",
        "job exploration visa",
        "business exploration visa",
        "visit visa explore",
        "60 day visa",
        "120 day visa",
        "180 day visa"
      ],
      "source": "meydan_services_defination_ppt.pdf",
      "sourceTitle": "Meydan Services Definition"
    },
    {
      "name": "Family and Friends Visa",
      "category": "mresidency",
      "question": "What is the Family and Friends Visa?",
      "responses": [
        "The Family and Friends Visa is for inviting family or friends to visit you in the UAE without needing a sponsor. It comes as a single-entry or multi-entry visa for either 30 or 90 days. The application includes health insurance. You'll need a passport copy, marriage certificate if applicable, and proof of relationship.",
        "Want to bring family or friends to visit? The Family and Friends Visa provides single-entry or multi-entry options for 30 or 90 days — and doesn't require a sponsor. Health insurance is included with the application. Documents needed are passport copy, marriage certificate (if applicable), and proof of relationship.",
        "The Family and Friends Visa lets you invite your loved ones to the UAE for 30 or 90 days. Available as single-entry or multi-entry, no sponsor required. The package includes health insurance. Just submit a passport copy, marriage certificate if relevant, and documentation proving the relationship."
      ],
      "keywords": [
        "family visa",
        "friends visa",
        "family and friends visa",
        "visit visa family",
        "invite family uae",
        "30 day visit visa",
        "90 day visit visa",
        "multi entry visa",
        "visitor visa",
        "family visit"
      ],
      "source": "meydan_services_defination_ppt.pdf",
      "sourceTitle": "Meydan Services Definition"
    },
    {
      "name": "Golden Visa",
      "category": "mresidency",
      "question": "What is the Golden Visa and how much does it cost?",
      "responses": [
        "The Golden Visa is a long-term UAE visa available for 5 years (AED 1,550) or 10 years (AED 4,000). It's available for entrepreneurs, investors, property investors, high school students, ratified university graduates, scientists, and specialists. Additional costs include AED 300 for the medical test and AED 10 for biometrics. We handle the medical and Emirates ID application, schedule appointments, and assist throughout the process.",
        "Golden Visa gives you 5 or 10 years of UAE residency. A 5-year Golden Visa costs AED 1,550 and a 10-year costs AED 4,000, plus AED 300 for medical and AED 10 for biometrics. Eligible categories include entrepreneurs, investors, property investors, top graduates, scientists, and specialists. We manage the full process — medical test scheduling, biometrics appointments, Emirates ID application, and everything in between.",
        "The UAE Golden Visa provides long-term residency for qualified professionals and investors. Pricing: AED 1,550 for 5 years or AED 4,000 for 10 years, plus AED 300 medical test and AED 10 biometrics fee. Eligible categories: entrepreneurs, investors, property investors, high school students, university graduates, scientists, and specialists. Our team handles the full application — from medical appointments to Emirates ID processing."
      ],
      "keywords": [
        "golden visa",
        "10 year visa",
        "5 year visa",
        "golden visa cost",
        "1550 visa",
        "4000 visa",
        "long term visa uae",
        "golden visa meydan",
        "entrepreneur visa",
        "investor golden visa",
        "golden visa categories",
        "golden visa eligibility"
      ],
      "source": "meydan_services_defination_ppt.pdf",
      "sourceTitle": "Meydan Services Definition"
    },
    {
      "name": "Virtual Assistant Starter",
      "category": "massist",
      "question": "What is the Virtual Assistant Starter service?",
      "responses": [
        "Virtual Assistant Starter costs AED 12,000 and gives you a virtual assistant for 6 hours per week. They handle customer support, administration tasks, data entry, and other business activities. Perfect for entrepreneurs who need help but aren't ready for a full-time hire. Service activates within 5 business days.",
        "The VA Starter package is AED 12,000 for a virtual assistant working 6 hours a week. Your VA can manage customer support, admin tasks, data entry, and various business operations. Great for solo entrepreneurs who need reliable support without the overhead of a full-time employee. Setup takes about 5 business days.",
        "For AED 12,000, Virtual Assistant Starter provides 6 hours per week of dedicated support. Your VA handles customer service, administrative work, data entry, and other tasks you need off your plate. Ideal for startups and small business owners who want to focus on growth. Activation within 5 business days — just provide your contact details and VA requirements."
      ],
      "keywords": [
        "virtual assistant starter",
        "va starter",
        "virtual assistant",
        "12000 va",
        "6 hours assistant",
        "remote assistant",
        "virtual assistant cost",
        "va service",
        "business assistant",
        "admin assistant"
      ],
      "source": "meydan_services_defination_ppt.pdf",
      "sourceTitle": "Meydan Services Definition"
    },
    {
      "name": "Virtual Assistant Dedicated",
      "category": "massist",
      "question": "What is the Dedicated Virtual Assistant service?",
      "responses": [
        "The Dedicated Virtual Assistant is the premium tier at AED 90,000. You get a full-time VA working 8 hours a day (9 AM to 5 PM), maxing at 40 hours per week. They handle email management, customer support, data entry, scheduling, and all your administrative needs. Essentially a full-time remote employee dedicated exclusively to your business. Activates within 5 business days.",
        "For AED 90,000, the Dedicated VA service gives you a virtual assistant for 8 hours daily, Monday through Friday (9 AM - 5 PM). That's up to 40 hours per week of dedicated support — email management, customer service, admin tasks, data entry, and more. It's like having a full-time team member without the office overhead. Ready in 5 business days.",
        "The Dedicated Virtual Assistant package costs AED 90,000 and provides 8 hours of daily support (9:00 AM to 5:00 PM, 40 hours/week max). Your dedicated VA manages customer support, email, data entry, scheduling, and any administrative tasks your business needs. This is the ultimate solution for businesses that need consistent, full-time remote support. Setup takes 5 business days."
      ],
      "keywords": [
        "dedicated virtual assistant",
        "va dedicated",
        "full time va",
        "90000 va",
        "8 hours assistant",
        "dedicated assistant",
        "full time virtual assistant",
        "premium va",
        "40 hours assistant",
        "dedicated remote support"
      ],
      "source": "meydan_services_defination_ppt.pdf",
      "sourceTitle": "Meydan Services Definition"
    },
    {
      "name": "Social Media Management Service",
      "category": "massist",
      "question": "What is the Social Media Management service?",
      "responses": [
        "Social Media Management comes in two tiers: Starter at AED 500 and Premium at AED 1,000. It's an AI-powered platform for creating, scheduling, and managing your social media posts across multiple platforms. Features include AI-generated content with tailored text and design, a content planner calendar, a media library, performance tracking dashboard for engagement and growth metrics, and hashtag search tools. Starter gets you 16 posts/month, Premium gives you 28 posts/month. Setup within 2 business days.",
        "We offer AI-powered social media management starting at AED 500 (Starter) or AED 1,000 (Premium). The platform handles content creation with AI-generated posts, scheduling, publishing, analytics, and hashtag research. Starter plan includes 16 posts per month and Premium gives you 28 posts monthly, plus a dedicated social media team. Ready in 2 business days.",
        "The Social Media Management service uses AI to handle your social presence. Two plans: Starter (AED 500, 16 posts/month) and Premium (AED 1,000, 28 posts/month). Both include AI content creation, content calendar and scheduling, media library, performance analytics dashboard, and hashtag search. The Premium tier adds a dedicated marketing team. Activates in 2 business days."
      ],
      "keywords": [
        "social media management",
        "social media service",
        "500 social media",
        "1000 social media",
        "social media posts",
        "ai social media",
        "instagram management",
        "content creation",
        "social media marketing",
        "social media starter",
        "social media premium"
      ],
      "source": "meydan_services_defination_ppt.pdf",
      "sourceTitle": "Meydan Services Definition"
    },
    {
      "name": "PO Box Cancellation",
      "category": "massist",
      "question": "How much does PO Box cancellation cost?",
      "responses": [
        "PO Box cancellation costs AED 500. Just provide your PO Box number and we'll process the termination. The cancellation permanently terminates the PO Box number registered under your company.",
        "Cancelling your PO Box is AED 500. Once cancelled, the PO Box number registered under your company is terminated permanently. You just need to provide the PO Box number to initiate the process.",
        "To cancel your PO Box service, the fee is AED 500. This terminates the PO Box number registered under your company. Pretty straightforward — just give us the PO Box number and we handle the rest."
      ],
      "keywords": [
        "po box cancellation",
        "cancel po box",
        "po box cancel cost",
        "500 po box",
        "terminate po box",
        "close po box",
        "po box cancel fee"
      ],
      "source": "meydan_services_defination_ppt.pdf",
      "sourceTitle": "Meydan Services Definition"
    },
    {
      "name": "NOC Authority Specific Pricing",
      "category": "mpro",
      "question": "How much does each NOC authority cost?",
      "responses": [
        "NOC fees vary by authority. Here's the breakdown: DMA (Dubai Maritime Authority) — AED 825, 3-4 days. RERA (Real Estate Regulatory Agency) — AED 825, 2-5 days. MOCACE (Ministry of Economy) — AED 825, 4-10 days. DOPA (Dubai Police) — AED 825, 3-5 days. DCAA (Dubai Civil Aviation) — AED 1,100. DSC (Dubai Sports Council) — AED 1,100-5,800. RTA (Roads and Transport) — AED 1,100, 10-15 days. SIRA (Security Industry) — AED 1,200. KHDA (Knowledge and Human Development) — AED 18,000, 20 days. UAEMC (UAE Ministry of Economy) — AED 25,000, 15-20 days.",
        "Each NOC authority has different pricing and timelines. Budget options: DMA, RERA, MOCACE, DOPA at AED 825 each (3-10 days). Mid-range: DCAA and DSC at AED 1,100, RTA at AED 1,100 (10-15 days), SIRA at AED 1,200. Premium: KHDA at AED 18,000 (20 days) for training courses, and UAEMC at AED 25,000 (15-20 days). DSC can also be AED 5,800 depending on service type. Timeline varies by authority.",
        "Here's the NOC pricing per authority: DMA — AED 825 (3-4 days), RERA — AED 825 (2-5 days), MOCACE — AED 825 (4-10 days), DOPA — AED 825 (3-5 days), DCAA — AED 1,100, DSC — AED 1,100 to AED 5,800, RTA — AED 1,100 (10-15 days), SIRA — AED 1,200, KHDA — AED 18,000 (20 days, for training), UAEMC — AED 25,000 (15-20 days). Prices may vary based on specific NOC type within each authority."
      ],
      "keywords": [
        "noc pricing",
        "noc authority cost",
        "dcaa noc",
        "dma noc",
        "dsc noc",
        "rera noc",
        "sira noc",
        "uaemc noc",
        "mocace noc",
        "rta noc",
        "khda noc",
        "dopa noc",
        "noc fee by authority",
        "specific noc cost"
      ],
      "source": "meydan_services_defination_ppt.pdf",
      "sourceTitle": "Meydan Services Definition"
    },
    {
      "name": "UID Number Merge Service",
      "category": "mpro",
      "question": "What is UID Number Merge?",
      "responses": [
        "UID Number Merge resolves the issue of individuals being assigned multiple Unified Identification Numbers in the UAE immigration system. It costs AED 275 and involves updating immigration records by merging the duplicate UIDs. This prevents complications with visa processing and immigration records. You'll need your passports (old and new), Emirates ID, and residence visa if applicable.",
        "If you've been assigned multiple UIDs in the UAE immigration system, the UID Number Merge service fixes that for AED 275. It updates your immigration records by merging the duplicates, ensuring accurate records and preventing future complications. Bring your passports, Emirates ID, and residence visa copy if applicable.",
        "The UID Number Merge service costs AED 275 and fixes the common issue of having multiple Unified Identification Numbers in the UAE system. This can happen when passports change or immigration records get duplicated. We merge the UIDs in your immigration records to keep everything clean and avoid processing issues. Documents needed: all passports, Emirates ID, and residence visa."
      ],
      "keywords": [
        "uid merge",
        "uid number merge",
        "unified identification number",
        "275 uid",
        "merge uid",
        "duplicate uid",
        "immigration uid",
        "multiple uid",
        "uid fix"
      ],
      "source": "meydan_services_defination_ppt.pdf",
      "sourceTitle": "Meydan Services Definition"
    },
    {
      "name": "Movement Report Service",
      "category": "mpro",
      "question": "What is a Movement Report?",
      "responses": [
        "A Movement Report is an official entry/exit list from immigration showing all dates an expatriate entered and left the UAE. It costs AED 300 and is processed within 1 business day. Typically needed for residence visa cancellations from outside the country, company closures, police requests, or immigration status updates. Just provide the passport number and port details.",
        "The Movement Report service costs AED 300 and takes just 1 day. It's an official immigration document listing every entry and exit date for an expatriate to and from the UAE. You'll need this for visa cancellations when abroad, company closures, police requests, or status updates. We just need the passport number used for travel.",
        "Need a record of your UAE entries and exits? The Movement Report is AED 300, processed in 1 business day. It's an official immigration document showing all entry and exit dates. Common uses include visa cancellations from overseas, company wind-downs, police requirements, and immigration status updates. Provide your passport number and we handle the rest."
      ],
      "keywords": [
        "movement report",
        "entry exit report",
        "300 movement report",
        "immigration report",
        "travel history uae",
        "entry exit list",
        "movement history",
        "immigration movement"
      ],
      "source": "meydan_services_defination_ppt.pdf",
      "sourceTitle": "Meydan Services Definition"
    },
    {
      "name": "Employee List from Immigration",
      "category": "mpro",
      "question": "How do I get an Employee List from immigration?",
      "responses": [
        "The Employee List service provides a comprehensive list from immigration of all employees under your company's sponsorship. It costs AED 500 and takes 3 business days to process. This is an official immigration document useful for audits, compliance, and company administration.",
        "For AED 500, you can get an official Immigration Employee List showing all employees sponsored under your company. Processing takes 3 business days. This is the definitive record from immigration of everyone under your company's visa sponsorship.",
        "An Employee List from immigration costs AED 500 and takes 3 days. It gives you a complete, official list of all employees under your company's sponsorship directly from the immigration authority. Useful for compliance checks, audits, or internal records."
      ],
      "keywords": [
        "employee list",
        "immigration employee list",
        "500 employee list",
        "sponsored employees",
        "company employees list",
        "employees under sponsorship",
        "immigration list",
        "staff list immigration"
      ],
      "source": "meydan_services_defination_ppt.pdf",
      "sourceTitle": "Meydan Services Definition"
    },
    {
      "name": "Dubai Chambers Services",
      "category": "mpro",
      "question": "What are the Dubai Chambers services?",
      "responses": [
        "We offer two Dubai Chambers services. Company Registration costs AED 825 (service fee) plus AED 2,200 (authority fee) — you'll get portal credentials and a company registration number. Document Attestation is AED 550 (service fee) plus AED 150 (authority fee), processed in 2 business days — covers bills of origin, invoices, employee letters, and other documents that need Chamber attestation.",
        "Dubai Chambers services include: 1) Company Registration at AED 825 service fee + AED 2,200 authority fee — we register your company and provide you with portal access credentials and registration number. 2) Document Attestation at AED 550 service + AED 150 authority fee, done in 2 business days — for attesting bills of origin, invoices, employee letters, and other official documents through the Chamber.",
        "For Dubai Chambers, we handle two key services. Registration costs AED 3,025 total (AED 825 service + AED 2,200 authority fee) and sets you up with a company registration number plus portal login. Document Attestation is AED 700 total (AED 550 service + AED 150 authority fee), taking 2 business days for attestation of invoices, bills of origin, employee letters, and similar documents."
      ],
      "keywords": [
        "dubai chambers",
        "chamber registration",
        "chamber of commerce",
        "dubai chamber",
        "chamber attestation",
        "document attestation chamber",
        "825 chamber",
        "2200 chamber",
        "chamber company registration",
        "chamber document"
      ],
      "source": "meydan_services_defination_ppt.pdf",
      "sourceTitle": "Meydan Services Definition"
    },
    {
      "name": "Dubai Municipality Services",
      "category": "mpro",
      "question": "What are the Dubai Municipality services?",
      "responses": [
        "We handle two Dubai Municipality services. Company Registration costs AED 825 with no authority fee, done in 2 business days — you get portal credentials for the municipality system. Product Registration costs AED 825 service fee plus authority fees (AED 220 for non-edible products, AED 920 for edible products), taking up to 22 business days. For product registration you'll need product specs on company letterhead, free sale certificate, and product photos including packaging.",
        "Dubai Municipality services include: 1) Company Registration — AED 825, processed in 2 business days, gives you a username and password for the municipality portal. 2) Product Registration — AED 825 service fee + AED 220 authority fee for non-edible products or AED 920 for edible products, taking up to 22 business days. Product registration requires specifications on letterhead, free sale certificate from the import country, product photos, and packaging description.",
        "For Dubai Municipality, we offer Company Registration at AED 825 (2 business days) which gets you set up on the municipality portal. Product Registration is also AED 825 service fee, plus AED 220 authority fee for non-edible or AED 920 for edible products, with a timeline of up to 22 business days. You'll need product specifications, free sale certificate, product photos, and packaging details."
      ],
      "keywords": [
        "dubai municipality",
        "municipality registration",
        "product registration",
        "municipality product",
        "food registration",
        "edible registration",
        "municipality company",
        "dm registration",
        "municipality portal",
        "register product dubai"
      ],
      "source": "meydan_services_defination_ppt.pdf",
      "sourceTitle": "Meydan Services Definition"
    },
    {
      "name": "Ecommerce Account Setup Service",
      "category": "mcore",
      "question": "What does the Ecommerce Account Setup include?",
      "responses": [
        "The Ecommerce Account Setup service costs AED 1,000 and takes 10 business days. We set up your seller account on two ecommerce marketplaces and list your first SKU on both platforms. It's designed for business owners and entrepreneurs who want to start selling online quickly. Payment is required upfront to initiate the process.",
        "For AED 1,000, our Ecommerce Account Setup gets you a seller account on 2 ecommerce marketplaces with your first product (1 SKU) listed on both. Takes about 10 business days from start to finish. Perfect for businesses looking to break into online selling without the hassle of figuring out marketplace setup.",
        "The E-Commerce setup service is AED 1,000 with a 10-day turnaround. We handle creating your seller accounts on two ecommerce platforms and listing one SKU on both marketplaces. Great for entrepreneurs who want to get their products online quickly. Payment upfront to get started."
      ],
      "keywords": [
        "ecommerce setup",
        "ecommerce account",
        "seller account",
        "1000 ecommerce",
        "marketplace setup",
        "online selling",
        "ecommerce starter",
        "sell online",
        "amazon seller",
        "noon seller",
        "ecommerce registration"
      ],
      "source": "meydan_services_defination_ppt.pdf",
      "sourceTitle": "Meydan Services Definition"
    },
    {
      "name": "Corporate Secretarial Services",
      "category": "mpro",
      "question": "What are Corporate Secretarial services?",
      "responses": [
        "Corporate Secretarial services cost AED 275 and are completed within 3 business days. Meydan Free Zone handles corporate governance, company administration, ensuring compliance with statutory and regulatory requirements, and implementing Board of Directors decisions. This covers all the essential corporate paperwork and compliance tasks.",
        "For AED 275, our Corporate Secretarial service covers corporate governance, company administration, regulatory compliance, and implementing board decisions. Processing takes 3 business days. It ensures your company stays compliant with all statutory requirements without you having to manage the paperwork yourself.",
        "Corporate Secretarial is AED 275, processed in 3 business days. It includes maintaining robust corporate governance, effective administration of your company, ensuring compliance with all statutory and regulatory requirements, and implementing decisions made by your Board of Directors. Essential for keeping your company in good standing."
      ],
      "keywords": [
        "corporate secretarial",
        "secretary service",
        "275 secretarial",
        "corporate governance",
        "company secretary",
        "corporate compliance",
        "board resolution",
        "company administration",
        "regulatory compliance"
      ],
      "source": "meydan_services_defination_ppt.pdf",
      "sourceTitle": "Meydan Services Definition"
    }
  ]
}