{
  "intents": [
    {
      "name": "Do I need to be physically present to open a compa",
      "category": "general",
      "response": "Physical presence is not required to set up a company.",
      "keywords": [
        "do i need to be physically present to open a company",
        "do i have to be in dubai to open a company",
        "can i open a company remotely",
        "is physical presence required"
      ]
    },
    {
      "name": "Are there any paid-up share capital requirements",
      "category": "general",
      "response": "No paid-up share capital is required.",
      "keywords": [
        "are there any paid-up share capital requirements",
        "do i need paid-up capital",
        "is paid-up share capital mandatory"
      ]
    },
    {
      "name": "Do shareholders need NOC to incorporate a company",
      "category": "general",
      "response": "NOC is not required to incorporate a company.",
      "keywords": [
        "do shareholders need noc to incorporate a company",
        "is noc required to open a company",
        "do individual or corporate shareholders require noc"
      ]
    },
    {
      "name": "Can I apply for a zero visa license",
      "category": "general",
      "response": "Yes, you can get a license with a zero-visa at Meydan Free Zone.",
      "keywords": [
        "can i apply for a zero visa license",
        "is a 0 visa license allowed",
        "can i get a license without visas"
      ]
    },
    {
      "name": "Can I combine commercial, professional, and tradin",
      "category": "general",
      "response": "Yes, the combination of activities is permitted.",
      "keywords": [
        "can i combine commercial professional and trading activities",
        "can i combine multiple activities on one license",
        "can i mix activities on the same license"
      ]
    },
    {
      "name": "What documents will I receive after company incorp",
      "category": "general",
      "response": "Business License, Certificate of Formation, Share Register, Memorandum of Association, Lease Agreement.",
      "keywords": [
        "what documents will i receive after company incorporation",
        "what documents do i get after company setup",
        "what papers are issued after incorporation"
      ]
    },
    {
      "name": "How many shareholders are allowed",
      "category": "general",
      "response": "A maximum of 100 shareholders are permitted. If more than 6 shareholders, AED 2000 is charged for each additional shareholder.",
      "keywords": [
        "how many shareholders are allowed",
        "maximum shareholders on a license"
      ]
    },
    {
      "name": "How many directors are allowed",
      "category": "general",
      "response": "A maximum of 4 directors are permitted.",
      "keywords": [
        "how many directors are allowed",
        "director limit per license"
      ]
    },
    {
      "name": "How many managers are allowed",
      "category": "general",
      "response": "A maximum of 1 manager is permitted.",
      "keywords": [
        "how many managers are allowed",
        "manager limit per company"
      ]
    },
    {
      "name": "How many activities are included free of cost",
      "category": "general",
      "response": "You can incorporate the company with 3 groups of activities without any additional charge.",
      "keywords": [
        "how many activities are included free of cost",
        "free activity groups"
      ]
    },
    {
      "name": "What is the cost of adding additional activities",
      "category": "general",
      "response": "The cost of additional activities is AED 1000 per activity. Approvals are required only for regulated activities.",
      "keywords": [
        "what is the cost of adding additional activities",
        "additional activity fee"
      ]
    },
    {
      "name": "Is there a discount for multi-year license applica",
      "category": "general",
      "response": "For multi-year license applications, 2 or more years, there is a standard discount of 15%.",
      "keywords": [
        "is there a discount for multi-year license applications",
        "multi year license discount"
      ]
    },
    {
      "name": "Can I be a partner in more than one company",
      "category": "general",
      "response": "Yes, you can be a partner or shareholder in multiple companies.",
      "keywords": [
        "can i be a partner in more than one company",
        "can i own multiple companies"
      ]
    },
    {
      "name": "What is the next step after submitting the license",
      "category": "general",
      "response": "Shareholders, managers, and directors receive an email for KYC, acceptance, and compliance. Once completed, the application is reviewed.",
      "keywords": [
        "what is the next step after submitting the license application",
        "what happens after applying for a license"
      ]
    },
    {
      "name": "What is the maximum license validity",
      "category": "general",
      "response": "The maximum license validity is 10 years.",
      "keywords": [
        "what is the maximum license validity",
        "license validity period"
      ]
    },
    {
      "name": "Will a multi-year license company get a free amend",
      "category": "general",
      "response": "Yes, if the company holds a multi-year license, they will get a free amendment.",
      "keywords": [
        "will a multi-year license company get a free amendment",
        "free amendment with multi year license"
      ]
    },
    {
      "name": "Is there a grace period after the license expires",
      "category": "general",
      "response": "A 30-day grace period is provided from the license expiry date.",
      "keywords": [
        "is there a grace period after the license expires",
        "license renewal grace period"
      ]
    },
    {
      "name": "Is there a penalty if the license is not renewed o",
      "category": "general",
      "response": "Yes, the penalty fee is AED 500. This is a one-time fee.",
      "keywords": [
        "is there a penalty if the license is not renewed on time",
        "license late renewal penalty"
      ]
    },
    {
      "name": "Is there a grace period after the immigration card",
      "category": "general",
      "response": "No, there is no grace period provided when the immigration card expires.",
      "keywords": [
        "is there a grace period after the immigration card expires"
      ]
    },
    {
      "name": "Is there a penalty if the immigration card expires",
      "category": "general",
      "response": "Yes, the penalty fee is AED 250 per month from the immigration card expiry date.",
      "keywords": [
        "is there a penalty if the immigration card expires"
      ]
    },
    {
      "name": "Can share allocation or total share capital be fra",
      "category": "general",
      "response": "No, share allocation and the total share capital cannot be a fraction.",
      "keywords": [
        "can share allocation or total share capital be fractional",
        "can shares be in decimals"
      ]
    },
    {
      "name": "What address will be mentioned in the company lice",
      "category": "general",
      "response": "Meydan Grandstand, Next to Meydan Hotel, 6th Floor, Meydan Road, Nad Al Sheba, Dubai, U.A.E.",
      "keywords": [
        "what address will be mentioned in the company license",
        "office address on license"
      ]
    },
    {
      "name": "When is the Audit Financial Statement Declaration ",
      "category": "general",
      "response": "At the time of license renewal.",
      "keywords": [
        "when is the audit financial statement declaration required",
        "audit declaration timing"
      ]
    },
    {
      "name": "Can the client convert LLC to Branch or Branch to ",
      "category": "general",
      "response": "No, it is not possible.",
      "keywords": [
        "can the client convert llc to branch or branch to llc"
      ]
    },
    {
      "name": "Can I have a shop outside the Meydan Free Zone",
      "category": "general",
      "response": "No, you need to have a shop within the Meydan Free Zone area.",
      "keywords": [
        "can i have a shop outside the meydan free zone"
      ]
    },
    {
      "name": "Can the client change the address in the business ",
      "category": "general",
      "response": "Yes, the address can be changed, but it must be in the Meydan Free Zone area only.",
      "keywords": [
        "can the client change the address in the business license"
      ]
    },
    {
      "name": "Will I receive a Chamber of Commerce certificate",
      "category": "general",
      "response": "No, a Chamber of Commerce certificate will not be issued.",
      "keywords": [
        "will i receive a chamber of commerce certificate"
      ]
    },
    {
      "name": "Can I hold property under my Meydan Free Zone comp",
      "category": "general",
      "response": "Yes, you can hold property under your company.",
      "keywords": [
        "can i hold property under my meydan free zone company"
      ]
    },
    {
      "name": "How many visa allocations are available to the com",
      "category": "general",
      "response": "6 visa allocations.",
      "keywords": [
        "how many visa allocations are available to the company"
      ]
    },
    {
      "name": "Can I get a DET permit with general trading activi",
      "category": "general",
      "response": "No, it is not possible.",
      "keywords": [
        "can i get a det permit with general trading activity"
      ]
    },
    {
      "name": "What is an immigration card",
      "category": "general",
      "response": "The immigration card is mandatory before applying for employment or investor visas.",
      "keywords": [
        "what is an immigration card"
      ]
    },
    {
      "name": "What is visa allocation",
      "category": "general",
      "response": "Visa allocation is the visa quota in immigration and is mandatory before applying for visas.",
      "keywords": [
        "what is visa allocation"
      ]
    },
    {
      "name": "Do immigration card and visa allocation have diffe",
      "category": "general",
      "response": "Immigration card and visa allocation have the same validity as the business license.",
      "keywords": [
        "do immigration card and visa allocation have different validity"
      ]
    },
    {
      "name": "How long does a company name change amendment take",
      "category": "general",
      "response": "Publication time is 14 days.",
      "keywords": [
        "how long does a company name change amendment take"
      ]
    },
    {
      "name": "Can a company provide its own MOA",
      "category": "general",
      "response": "No, the company cannot provide its own MOA.",
      "keywords": [
        "can a company provide its own moa"
      ]
    },
    {
      "name": "What are the fees for renewal with amendment",
      "category": "general",
      "response": "There are no extra fees unless a fourth activity group is added.",
      "keywords": [
        "what are the fees for renewal with amendment"
      ]
    },
    {
      "name": "What is the validity of corporate and employee let",
      "category": "general",
      "response": "The validity is 30 days.",
      "keywords": [
        "what is the validity of corporate and employee letters"
      ]
    },
    {
      "name": "What should be the validity of a board resolution",
      "category": "general",
      "response": "The board resolution must be valid for 15 days.",
      "keywords": [
        "what should be the validity of a board resolution"
      ]
    },
    {
      "name": "If license is cancelled after expiry, is penalty a",
      "category": "general",
      "response": "No penalty applies for the license, but immigration card fines must be paid if applicable.",
      "keywords": [
        "if license is cancelled after expiry is penalty applicable"
      ]
    },
    {
      "name": "Do visa allocations need to be renewed annually",
      "category": "general",
      "response": "Yes, visa allocation must be renewed annually along with the license and immigration card.",
      "keywords": [
        "do visa allocations need to be renewed annually"
      ]
    },
    {
      "name": "Is immigration card amendment required after compa",
      "category": "general",
      "response": "Yes, the company must apply for an immigration card amendment.",
      "keywords": [
        "is immigration card amendment required after company name change"
      ]
    },
    {
      "name": "Is there a minimum or maximum age for shareholders",
      "category": "general",
      "response": "There is no minimum and no maximum age.",
      "keywords": [
        "is there a minimum or maximum age for shareholders"
      ]
    },
    {
      "name": "Is there a minimum or maximum share capital",
      "category": "general",
      "response": "There is no minimum and no maximum share capital requirement.",
      "keywords": [
        "is there a minimum or maximum share capital"
      ]
    },
    {
      "name": "Do I need to be inside the UAE to process the Resi",
      "category": "general",
      "response": "Entry visa can be processed outside the country, but applicant must be inside UAE after e-visa issuance.",
      "keywords": [
        "do i need to be inside the uae to process the residence visa"
      ]
    },
    {
      "name": "How long is the Entry Visa valid",
      "category": "general",
      "response": "The entry permit is valid for 60 days.",
      "keywords": [
        "how long is the entry visa valid"
      ]
    },
    {
      "name": "How long is change of status valid",
      "category": "general",
      "response": "Change of status is valid for 60 days.",
      "keywords": [
        "how long is change of status valid"
      ]
    },
    {
      "name": "Do we need to submit original passport during visa",
      "category": "general",
      "response": "Visa stamping is no longer mandatory.",
      "keywords": [
        "do we need to submit original passport during visa application"
      ]
    },
    {
      "name": "Can residence visa be processed before biometrics",
      "category": "general",
      "response": "Yes, by signing the Emirates ID declaration form.",
      "keywords": [
        "can residence visa be processed before biometrics"
      ]
    },
    {
      "name": "How much time to complete biometrics",
      "category": "general",
      "response": "The client has 60 days to complete biometrics.",
      "keywords": [
        "how much time to complete biometrics"
      ]
    },
    {
      "name": "Minimum age for investor or partner visa",
      "category": "general",
      "response": "The minimum age is 18 years with AED 50,000 share capital.",
      "keywords": [
        "minimum age for investor or partner visa"
      ]
    },
    {
      "name": "Maximum age for investor or partner visa",
      "category": "general",
      "response": "There is no age limitation.",
      "keywords": [
        "maximum age for investor or partner visa"
      ]
    },
    {
      "name": "Minimum age for employee visa",
      "category": "general",
      "response": "The minimum age is 18 years.",
      "keywords": [
        "minimum age for employee visa"
      ]
    },
    {
      "name": "Maximum age for employee visa",
      "category": "general",
      "response": "The maximum age is 60 years.",
      "keywords": [
        "maximum age for employee visa"
      ]
    },
    {
      "name": "What are Meydan office timings",
      "category": "general",
      "response": "We are operating 24/7.",
      "keywords": [
        "what are meydan office timings"
      ]
    },
    {
      "name": "Where is Meydan Free Zone office located",
      "category": "general",
      "response": "Meydan Grandstand, 6th Floor, Meydan Road, Nad Al Sheba 1, Dubai, UAE.",
      "keywords": [
        "where is meydan free zone office located"
      ]
    },
    {
      "name": "Can client use Meydan PO Box",
      "category": "general",
      "response": "It is not allowed; clients may apply for their own PO Box via Meydan Plus.",
      "keywords": [
        "can client use meydan po box"
      ]
    },
    {
      "name": "Can Meydan receive goods or packages for clients",
      "category": "general",
      "response": "Deliveries are not accepted unless mail management services are registered.",
      "keywords": [
        "can meydan receive goods or packages for clients"
      ]
    },
    {
      "name": "Where is the Meydan share desk office",
      "category": "general",
      "response": "Meydan Grandstand, 6th Floor, Meydan Road, Nad Al Sheba, Dubai, U.A.E.",
      "keywords": [
        "where is the meydan share desk office"
      ]
    }
  ]
}